<?php
$goods = [
    [
        'ttl'   => '家　電', 
        'items' => [
            [
                'ttl' => '冷蔵庫',
                'img' => 'kaden/reizouko-s.png', 
                'items' => [
                    [
                        'idx'    => 0, 
                        'ttl'    => '100〜200L未満', 
                        'full_ttl'    => '冷蔵庫 [100〜200L未満]', 
                        'len_01' => 50, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 250000 
                    ], 
                    [
                        'idx'    => 1, 
                        'ttl'    => '200〜400L未満', 
                        'full_ttl'    => '冷蔵庫 [200〜400L未満]', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 160, 
                        'size'   => 576000
                    ], 
                    [
                        'idx'    => 2, 
                        'ttl'    => '400〜500L未満', 
                        'full_ttl'    => '冷蔵庫 [400〜500L未満]', 
                        'len_01' => 60, 
                        'len_02' => 65, 
                        'len_03' => 180, 
                        'size'   => 702000
                    ], 
                    [
                        'idx'    => 3, 
                        'ttl'    => '500L以上', 
                        'full_ttl'    => '冷蔵庫 [500L以上]', 
                        'len_01' => 60, 
                        'len_02' => 75, 
                        'len_03' => 180, 
                        'size'   => 877500
                    ], 
                ]
            ],
            [
                'ttl' => '洗濯機',
                'img' => 'kaden/sentakuki.png', 
                'items' => [
                    [
                        'idx'    => 4, 
                        'ttl'    => '4kg〜8kg', 
                        'full_ttl'    => '洗濯機 [4kg〜8kg]', 
                        'len_01' => 55, 
                        'len_02' => 55, 
                        'len_03' => 85, 
                        'size'   => 257125
                    ], 
                    [
                        'idx'    => 5, 
                        'ttl'    => '9kg以上', 
                        'full_ttl'    => '洗濯機 [9kg以上]', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 90, 
                        'size'   => 324000
                    ], 
                    [
                        'idx'    => 6, 
                        'ttl'    => 'ドラム式', 
                        'full_ttl'    => '洗濯機 [ドラム式]', 
                        'len_01' => 60, 
                        'len_02' => 70, 
                        'len_03' => 110, 
                        'size'   => 462000
                    ], 
                ]
            ],
            [
                'idx'    => 7, 
                'ttl' => 'レンジ',
                'img' => 'kaden/renji.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ],
            [
                'ttl' => 'エアコン',
                'img' => 'kaden/eakon.png', 
                'items' => [
                    [
                        'idx'    => 8, 
                        'ttl'    => '一般', 
                        'full_ttl'    => 'エアコン [一般]', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 90, 
                        'size'   => 216000
                    ], 
                    [
                        'idx'    => 9, 
                        'ttl'    => '窓用', 
                        'full_ttl'    => 'エアコン [窓用]', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 100, 
                        'size'   => 240000
                    ], 
                ]
            ],
            [
                'idx'    => 10, 
                'ttl' => 'ファンヒーター',
                'img' => 'kaden/pensutando.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ],
            [
                'ttl' => 'こたつ',
                'img' => 'kaden/kotatu.png', 
                'items' => [
                    [
                        'idx'    => 11, 
                        'ttl'    => '正方形', 
                        'full_ttl'    => 'こたつ [正方形]', 
                        'len_01' => 75, 
                        'len_02' => 75, 
                        'len_03' => 40, 
                        'size'   => 225000
                    ], 
                    [
                        'idx'    => 12, 
                        'ttl'    => '長方形', 
                        'full_ttl'    => 'こたつ [長方形]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 40, 
                        'size'   => 240000
                    ], 
                ]
            ],
            [
                'idx'    => 13, 
                'ttl' => '空気清浄機',
                'img' => 'kaden/kuukiseijyouki.png', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'items' => []
            ],
            [
                'idx'    => 14, 
                'ttl' => 'ウォーターサーバー',
                'img' => 'kaden/woterserver.png', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 150, 
                'size'   => 240000, 
                'items' => []
            ],
            [
                'idx'    => 15, 
                'ttl' => '掃除機',
                'img' => 'kaden/soujiki.png', 
                'len_01' => 30, 
                'len_02' => 30, 
                'len_03' => 90, 
                'size'   => 81000, 
                'items' => []
            ],
            [
                'idx'    => 16, 
                'ttl' => '扇風機',
                'img' => 'kaden/senpuuki.png', 
                'len_01' => 40, 
                'len_02' => 30, 
                'len_03' => 70, 
                'size'   => 84000, 
                'items' => []
            ],
            [
                'idx'    => 17, 
                'ttl' => 'ガスコンロ',
                'img' => 'kaden/konro.png', 
                'len_01' => 55, 
                'len_02' => 40, 
                'len_03' => 25, 
                'size'   => 55000, 
                'items' => []
            ],
            [
                'idx'    => 18, 
                'ttl' => 'オーブントースター',
                'img' => '', 
                'len_01' => 35, 
                'len_02' => 25, 
                'len_03' => 30, 
                'size'   => 26250, 
                'items' => []
            ],
            [
                'idx'    => 19, 
                'ttl' => '炊飯器',
                'img' => '', 
                'len_01' => 25, 
                'len_02' => 35, 
                'len_03' => 20, 
                'size'   => 17500, 
                'items' => []
            ],
            [
                'idx'    => 20, 
                'ttl' => 'ポット',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 30, 
                'len_03' => 25, 
                'size'   => 15000, 
                'items' => []
            ],
            [
                'idx'    => 21, 
                'ttl' => '照明器具',
                'img' => 'kaden/siiringulight.png', 
                'len_01' => 50, 
                'len_02' => 50, 
                'len_03' => 30, 
                'size'   => 75000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '家　具',
        'items' => [
            // 洋タンス（ワードロ－プ）
            [
                'ttl' => '洋タンス（ワードロ－プ）',
                'img' => 'kagu/youdansu.png', 
                'items' => [
                    [
                        'idx'    => 22, 
                        'ttl'    => '扉2枚タイプ', 
                        'full_ttl'    => '洋タンス [扉2枚タイプ]', 
                        'len_01' => 100, 
                        'len_02' => 70, 
                        'len_03' => 210, 
                        'size'   => 1470000
                    ], 
                    [
                        'idx'    => 23, 
                        'ttl'    => '扉3枚タイプ', 
                        'full_ttl'    => '洋タンス [扉3枚タイプ]', 
                        'len_01' => 140, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 1764000
                    ], 
                    [
                        'idx'    => 24, 
                        'ttl'    => '扉4枚タイプ', 
                        'full_ttl'    => '洋タンス [扉4枚タイプ]', 
                        'len_01' => 160, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 2016000
                    ], 
                ]
            ],
            // 和ダンス            
            [
                'ttl' => '和ダンス・5段引き出し',
                'img' => 'kagu/wadansu.jpg', 
                'items' => [
                    [
                        'idx'    => 25, 
                        'ttl'    => 'W100', 
                        'full_ttl'    => '和ダンス・5段引き出し [W100]', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 500000
                    ], 
                    [
                        'idx'    => 26, 
                        'ttl'    => 'W120', 
                        'full_ttl'    => '和ダンス・5段引き出し [W120]', 
                        'len_01' => 120, 
                        'len_02' => 60, 
                        'len_03' => 130, 
                        'size'   => 936000
                    ], 
                ]
            ],
            // 整理ダンス
            [
                'ttl' => '整理ダンス',
                'img' => 'kagu/seiridansu.png', 
                'items' => [
                    [
                        'idx'    => 27, 
                        'ttl'    => '引出3段以下', 
                        'full_ttl'    => '整理ダンス [引出3段以下]', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 60, 
                        'size'   => 396000
                    ], 
                    [
                        'idx'    => 28, 
                        'ttl'    => '引出5段以下', 
                        'full_ttl'    => '整理ダンス [引出5段以下]', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 110, 
                        'size'   => 726000
                    ], 
                    [
                        'idx'    => 29, 
                        'ttl'    => '引出6段以上', 
                        'full_ttl'    => '整理ダンス [引出6段以上]', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 150, 
                        'size'   => 990000
                    ], 
                ]
            ],
            // ベッド
            [
                'ttl' => 'ベッド',
                'img' => 'kagu/bed.png', 
                'items' => [
                    [
                        'idx'    => 30, 
                        'ttl'    => 'シングル', 
                        'full_ttl'    => 'ベッド [シングル]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1260000
                    ], 
                    [
                        'idx'    => 31, 
                        'ttl'    => 'セミダブル', 
                        'full_ttl'    => 'ベッド [セミダブル]', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1312500
                    ], 
                    [
                        'idx'    => 32, 
                        'ttl'    => 'ダブル', 
                        'full_ttl'    => 'ベッド [ダブル]', 
                        'len_01' => 165, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1732500
                    ], 
                    [
                        'idx'    => 33, 
                        'ttl'    => 'クイーン', 
                        'full_ttl'    => 'ベッド [クイーン]', 
                        'len_01' => 180, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1890000
                    ], 
                    [
                        'idx'    => 34, 
                        'ttl'    => 'ダブル二つ折り', 
                        'full_ttl'    => 'ベッド [ダブル二つ折り]', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 687500
                    ], 
                ]
            ],
            // マットレス
            [
                'ttl' => 'マットレス',
                'img' => 'kagu/mattoresu.jpg', 
                'items' => [
                    [
                        'idx'    => 35, 
                        'ttl'    => 'シングル', 
                        'full_ttl'    => 'マットレス [シングル]', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1000000
                    ], 
                    [
                        'idx'    => 36, 
                        'ttl'    => 'セミダブル', 
                        'full_ttl'    => 'マットレス [セミダブル]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1200000
                    ], 
                    [
                        'idx'    => 37, 
                        'ttl'    => 'ダブル', 
                        'full_ttl'    => 'マットレス [ダブル]', 
                        'len_01' => 140, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1400000
                    ], 
                    [
                        'idx'    => 38, 
                        'ttl'    => 'クイーン', 
                        'full_ttl'    => 'マットレス [クイーン]', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1600000
                    ], 
                    [
                        'idx'    => 39, 
                        'ttl'    => '折り畳み', 
                        'full_ttl'    => 'マットレス [折り畳み]', 
                        'len_01' => 100, 
                        'len_02' => 60, 
                        'len_03' => 70, 
                        'size'   => 420000
                    ], 
                ]
            ],
            // メタルラック（分解可）
            [
                'ttl' => 'メタルラック（分解可）',
                'img' => 'kagu/', 
                'items' => [
                    [
                        'idx'    => 40, 
                        'ttl'    => '横幅60以下', 
                        'full_ttl'    => 'メタルラック（分解可） [横幅60以下]', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 648000
                    ], 
                    [
                        'idx'    => 41, 
                        'ttl'    => '横幅90以下', 
                        'full_ttl'    => 'メタルラック（分解可） [横幅90以下]', 
                        'len_01' => 90, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 972000
                    ], 
                    [
                        'idx'    => 42, 
                        'ttl'    => '横幅120以上', 
                        'full_ttl'    => 'メタルラック（分解可） [横幅120以上]', 
                        'len_01' => 180, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 1944000
                    ], 
                ]
            ],
            // ローボード
            [
                'idx'    => 43, 
                'ttl' => 'ローボード',
                'img' => 'kagu/ro-bord.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 50, 
                'size'   => 225000, 
                'items' => []
            ],
            // 姿見
            [
                'idx'    => 44, 
                'ttl' => '姿見',
                'img' => 'kagu/sugatami.png', 
                'len_01' => 30, 
                'len_02' => 190, 
                'len_03' => 20, 
                'size'   => 114000, 
                'items' => []
            ],
            // ドレッサー
            [
                'ttl' => 'ドレッサー',
                'img' => 'kagu/doressa-.png', 
                'items' => [
                    [
                        'idx'    => 45, 
                        'ttl'    => '横幅60以下', 
                        'full_ttl'    => 'ドレッサー [横幅60以下]', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 216000
                    ], 
                    [
                        'idx'    => 46, 
                        'ttl'    => '横幅90以下', 
                        'full_ttl'    => 'ドレッサー [横幅90以下]', 
                        'len_01' => 90, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 324000
                    ], 
                    [
                        'idx'    => 47, 
                        'ttl'    => '横幅91以上', 
                        'full_ttl'    => 'ドレッサー [横幅91以上]', 
                        'len_01' => 120, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 432000
                    ], 
                ]
            ],
            // 本棚
            [
                'ttl' => '本棚',
                'img' => 'kagu/hondana.png', 
                'items' => [
                    [
                        'idx'    => 48, 
                        'ttl'    => '100cm以下', 
                        'full_ttl'    => '本棚 [100cm以下]', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 350000
                    ], 
                    [
                        'idx'    => 49, 
                        'ttl'    => '150cm以下', 
                        'full_ttl'    => '本棚 [150cm以下]', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 150, 
                        'size'   => 525000
                    ], 
                    [
                        'idx'    => 50, 
                        'ttl'    => '180cm以下', 
                        'full_ttl'    => '本棚 [180cm以下]', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 180, 
                        'size'   => 630000
                    ], 
                ]
            ],
            // カーペット（6畳まで）
            [
                'idx'    => 51, 
                'ttl' => 'カーペット（6畳まで）',
                'img' => 'kagu/karpet.png', 
                'len_01' => 360, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 576000, 
                'items' => []
            ],
            // 学習机
            [
                'ttl' => '学習机',
                'img' => 'kagu/gakusyudukue.jpg', 
                'items' => [
                    [
                        'idx'    => 52, 
                        'ttl'    => '本体のみ', 
                        'full_ttl'    => '学習机 [本体のみ]', 
                        'len_01' => 110, 
                        'len_02' => 75, 
                        'len_03' => 75, 
                        'size'   => 618750
                    ], 
                    [
                        'idx'    => 53, 
                        'ttl'    => '脇棚', 
                        'full_ttl'    => '学習机 [脇棚]', 
                        'len_01' => 50, 
                        'len_02' => 70, 
                        'len_03' => 75, 
                        'size'   => 262500
                    ], 
                ]
            ],
            // 机用椅子
            [
                'idx'    => 54, 
                'ttl' => '机用椅子',
                'img' => 'kagu/tukueyouisu.jpg', 
                'len_01' => 40, 
                'len_02' => 60, 
                'len_03' => 95, 
                'size'   => 228000, 
                'items' => []
            ],
            // ソファー
            [
                'ttl' => 'ソファー',
                'img' => 'kagu/sofa.png', 
                'items' => [
                    [
                        'idx'    => 55, 
                        'ttl'    => '1人掛け', 
                        'full_ttl'    => 'ソファー [1人掛け]', 
                        'len_01' => 80, 
                        'len_02' => 90, 
                        'len_03' => 50, 
                        'size'   => 648000
                    ], 
                    [
                        'idx'    => 56, 
                        'ttl'    => '2人掛け', 
                        'full_ttl'    => 'ソファー [2人掛け]', 
                        'len_01' => 150, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1080000
                    ], 
                    [
                        'idx'    => 57, 
                        'ttl'    => '3人掛け', 
                        'full_ttl'    => 'ソファー [3人掛け]', 
                        'len_01' => 240, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1728000
                    ], 
                    [
                        'idx'    => 58, 
                        'ttl'    => 'L字型', 
                        'full_ttl'    => 'ソファー [L字型]', 
                        'len_01' => 390, 
                        'len_02' => 160, 
                        'len_03' => 180, 
                        'size'   => 11232000
                    ], 
                    [
                        'idx'    => 59, 
                        'ttl'    => 'オットマン', 
                        'full_ttl'    => 'ソファー [オットマン]', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 40, 
                        'size'   => 256000
                    ], 
                ]
            ],
            // リビングテーブル
            [
                'ttl' => 'リビングテーブル',
                'img' => 'kagu/ribingute-buru.png', 
                'items' => [
                    [
                        'idx'    => 60, 
                        'ttl'    => '横幅100cmまで', 
                        'full_ttl'    => 'リビングテーブル [横幅100cmまで]', 
                        'len_01' => 100, 
                        'len_02' => 75, 
                        'len_03' => 55, 
                        'size'   => 412500
                    ], 
                    [
                        'idx'    => 61, 
                        'ttl'    => '横幅100cm以上', 
                        'full_ttl'    => 'リビングテーブル [横幅100cm以上]', 
                        'len_01' => 160, 
                        'len_02' => 70, 
                        'len_03' => 55, 
                        'size'   => 616000
                    ], 
                ]
            ],
            // 食器棚（分解可能）
            [
                'ttl' => '食器棚（分解可能）',
                'img' => 'kagu/syokkidana.png', 
                'items' => [
                    [
                        'idx'    => 62, 
                        'ttl'    => '横幅90cm以下', 
                        'full_ttl'    => '食器棚（分解可能） [横幅90cm以下]', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 832500
                    ], 
                    [
                        'idx'    => 63, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => '食器棚（分解可能） [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1110000
                    ], 
                    [
                        'idx'    => 64, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => '食器棚（分解可能） [横幅121cm以上]', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1387500
                    ], 
                ]
            ],
            // 食器棚（分解不可）
            [
                'idx'    => 65, 
                'ttl' => '食器棚（分解不可）',
                'img' => 'kagu/syokkidana2.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 190, 
                'size'   => 855000, 
                'items' => []
            ],
            // 食卓テーブル
            [
                'ttl' => '食卓テーブル',
                'img' => 'kagu/syokutakute-buru.png', 
                'items' => [
                    [
                        'idx'    => 66, 
                        'ttl'    => '横幅90cm以下', 
                        'full_ttl'    => '食卓テーブル [横幅90cm以下]', 
                        'len_01' => 90, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 792000
                    ], 
                    [
                        'idx'    => 67, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => '食卓テーブル [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1056000
                    ], 
                    [
                        'idx'    => 68, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => '食卓テーブル [横幅121cm以上]', 
                        'len_01' => 160, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1408000
                    ], 
                ]
            ],
            // 椅子
            [
                'idx'    => 69, 
                'ttl' => '椅子',
                'img' => 'kagu/isu.png', 
                'len_01' => 40, 
                'len_02' => 50, 
                'len_03' => 90, 
                'size'   => 180000, 
                'items' => []
            ], 
            // ローテーブル
            [
                'ttl' => 'ローテーブル',
                'img' => 'kagu/ro-te-buru.jpg', 
                'items' => [
                    [
                        'idx'    => 70, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => 'ローテーブル [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000
                    ], 
                    [
                        'idx'    => 71, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => 'ローテーブル [横幅121cm以上]', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 375000
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'AV・PC',
        'items' => [
            // ブラウン管テレビ
            [
                'ttl' => 'ブラウン管テレビ',
                'img' => 'avpc/buraunkan.jpg', 
                'items' => [
                    [
                        'idx'    => 72, 
                        'ttl'    => '21未満', 
                        'full_ttl'    => 'ブラウン管テレビ [21未満]', 
                        'len_01' => 50, 
                        'len_02' => 60, 
                        'len_03' => 50, 
                        'size'   => 150000
                    ], 
                    [
                        'idx'    => 73, 
                        'ttl'    => '21以上50未満', 
                        'full_ttl'    => 'ブラウン管テレビ [21以上50未満]', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 80, 
                        'size'   => 512000
                    ], 
                    [
                        'idx'    => 74, 
                        'ttl'    => '50以上', 
                        'full_ttl'    => 'ブラウン管テレビ [50以上]', 
                        'len_01' => 100, 
                        'len_02' => 100, 
                        'len_03' => 100, 
                        'size'   => 1000000
                    ], 
                ]
            ],
            // 液晶テレビ
            [
                'ttl' => '液晶テレビ',
                'img' => 'avpc/tv.png', 
                'items' => [
                    [
                        'idx'    => 75, 
                        'ttl'    => '32未満', 
                        'full_ttl'    => '液晶テレビ [32未満]', 
                        'len_01' => 70, 
                        'len_02' => 40, 
                        'len_03' => 40, 
                        'size'   => 112000
                    ], 
                    [
                        'idx'    => 76, 
                        'ttl'    => '32以上50未満', 
                        'full_ttl'    => '液晶テレビ [32以上50未満]', 
                        'len_01' => 110, 
                        'len_02' => 40, 
                        'len_03' => 60, 
                        'size'   => 264000
                    ], 
                    [
                        'idx'    => 77, 
                        'ttl'    => '50以上', 
                        'full_ttl'    => '液晶テレビ [50以上]', 
                        'len_01' => 150, 
                        'len_02' => 60, 
                        'len_03' => 80, 
                        'size'   => 720000
                    ], 
                ]
            ], 
            // テレビ台（ロータイプ）
            [
                'ttl' => 'テレビ台（ロータイプ）',
                'img' => 'avpc/tv-dai.png', 
                'items' => [
                    [
                        'idx'    => 78, 
                        'ttl'    => '横幅90cm以下', 
                        'full_ttl'    => 'テレビ台（ロータイプ） [横幅90cm以下]', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 225000
                    ], 
                    [
                        'idx'    => 79, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => 'テレビ台（ロータイプ） [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000
                    ], 
                    [
                        'idx'    => 80, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => 'テレビ台（ロータイプ） [横幅121cm以上]', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 400000
                    ], 
                ]
            ], 
            // テレビ台（特大）
            [
                'idx'    => 81, 
                'ttl' => 'テレビ台（特大）',
                'img' => 'avpc/tv-dai-tokudai.jpg', 
                'len_01' => 180, 
                'len_02' => 60, 
                'len_03' => 180, 
                'size'   => 1944000, 
                'items' => []
            ], 
            // デスクトップパソコン
            [
                'idx'    => 82, 
                'ttl' => 'デスクトップパソコン',
                'img' => 'avpc/pc.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 80000, 
                'items' => []
            ], 
            // パソコンラック
            [
                'idx'    => 83, 
                'ttl' => 'パソコンラック',
                'img' => 'avpc/pc-rack.png', 
                'len_01' => 60, 
                'len_02' => 50, 
                'len_03' => 110, 
                'size'   => 330000, 
                'items' => []
            ], 
            // プリンター
            [
                'idx'    => 84, 
                'ttl' => 'プリンター',
                'img' => 'avpc/purinter.jpg', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => '生活用品',
        'items' => [
            // 衣装ケース
            [
                'ttl' => '衣装ケース',
                'img' => 'seikatuyouhin/isyoucase.png', 
                'items' => [
                    [
                        'idx'    => 85, 
                        'ttl'    => '1段', 
                        'full_ttl'    => '衣装ケース [1段]', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 25, 
                        'size'   => 73125
                    ], 
                    [
                        'idx'    => 86, 
                        'ttl'    => '2段', 
                        'full_ttl'    => '衣装ケース [2段]', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 50, 
                        'size'   => 146250
                    ], 
                    [
                        'idx'    => 87, 
                        'ttl'    => '3段以上', 
                        'full_ttl'    => '衣装ケース [3段以上]', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 234000
                    ], 
                ]
            ],
            // カラーボックス
            [
                'ttl' => 'カラーボックス',
                'img' => 'seikatuyouhin/corolbox.png', 
                'items' => [
                    [
                        'idx'    => 88, 
                        'ttl'    => '1段', 
                        'full_ttl'    => 'カラーボックス [1段]', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 35, 
                        'size'   => 47250
                    ], 
                    [
                        'idx'    => 89, 
                        'ttl'    => '2段', 
                        'full_ttl'    => 'カラーボックス [2段]', 
                        'len_01' => 45, 
                        'len_02' => 60, 
                        'len_03' => 35, 
                        'size'   => 94500
                    ], 
                    [
                        'idx'    => 90, 
                        'ttl'    => '3段以上', 
                        'full_ttl'    => 'カラーボックス [3段以上]', 
                        'len_01' => 45, 
                        'len_02' => 90, 
                        'len_03' => 35, 
                        'size'   => 141750
                    ], 
                ]
            ],
            // パイプハンガー
            [
                'ttl' => 'パイプハンガー',
                'img' => 'seikatuyouhin/paipuhanger.png', 
                'items' => [
                    [
                        'idx'    => 91, 
                        'ttl'    => '小', 
                        'full_ttl'    => 'パイプハンガー [小]', 
                        'len_01' => 90, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 243000
                    ], 
                    [
                        'idx'    => 92, 
                        'ttl'    => '大', 
                        'full_ttl'    => 'パイプハンガー [大]', 
                        'len_01' => 120, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 324000
                    ], 
                ]
            ],
            // 布団一式
            [
                'idx'    => 93, 
                'ttl' => '布団一式',
                'img' => 'seikatuyouhin/huton.png', 
                'len_01' => 60, 
                'len_02' => 90, 
                'len_03' => 50, 
                'size'   => 270000, 
                'items' => []
            ], 
            // 物干し竿
            [
                'idx'    => 94, 
                'ttl' => '物干し竿',
                'img' => 'seikatuyouhin/monohosizao.png', 
                'len_01' => 20, 
                'len_02' => 20, 
                'len_03' => 150, 
                'size'   => 60000, 
                'items' => []
            ], 
            // スーツケース
            [
                'idx'    => 95, 
                'ttl' => 'スーツケース',
                'img' => 'seikatuyouhin/su-tucase.jpg', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => 'その他',
        'items' => [
            // 自転車
            [
                'ttl' => '自転車',
                'img' => '', 
                'items' => [
                    [
                        'idx'    => 96, 
                        'ttl'    => '大人用', 
                        'full_ttl'    => '自転車 [大人用]', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 880000
                    ], 
                    [
                        'idx'    => 97, 
                        'ttl'    => '子供用', 
                        'full_ttl'    => '自転車 [子供用]', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 90, 
                        'size'   => 450000
                    ], 
                    [
                        'idx'    => 98, 
                        'ttl'    => '折り畳み', 
                        'full_ttl'    => '自転車 [折り畳み]', 
                        'len_01' => 80, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 440000
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'ダンボール',
        'items' => [
            // ダンボール
            [
                'ttl' => 'ダンボール',
                'img' => '', 
                'items' => [
                    [
                        'idx'    => 99, 
                        'ttl'    => '大', 
                        'full_ttl'    => 'ダンボール [大]', 
                        'len_01' => 55, 
                        'len_02' => 40, 
                        'len_03' => 35, 
                        'size'   => 77000
                    ], 
                    [
                        'idx'    => 100, 
                        'ttl'    => '小', 
                        'full_ttl'    => 'ダンボール [小]', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 40, 
                        'size'   => 63000
                    ], 
                ]
            ],
        ]
    ], 
];

$options = [
    [
        'ttl'   => '家　電　設　置', 
        'items' => [
            // テレビ設置
            [
                'ttl' => 'テレビ設置',
                'size'   => 2273, 
                'items' => []
            ],
            // 録画機器設置
            [
                'ttl' => '録画機器設置',
                'size'   => 2273, 
                'items' => []
            ],
            // 洗濯機設置
            [
                'ttl' => '洗濯機設置',
                'items' => [
                    [
                        'ttl'    => '縦型', 
                        'size'   => 3500
                    ],
                    [
                        'ttl'    => 'ドラム式', 
                        'size'   => 5000
                    ],
                    [
                        'ttl'    => '二層式', 
                        'size'   => 3500
                    ],
                ],
            ],
            // エアコン標準移設
            [
                'ttl' => 'エアコン標準移設',
                'items' => [
                    [
                        'ttl'    => '～2.8KW', 
                        'size'   => 15000
                    ],
                    [
                        'ttl'    => '3.6KW・4.0KW', 
                        'size'   => 17000
                    ],
                    [
                        'ttl'    => '5.6KW', 
                        'size'   => 19000
                    ],
                    [
                        'ttl'    => '6.3KW', 
                        'size'   => 21000
                    ],
                ],
            ],
            // 照明取外・取付
            [
                'ttl' => '照明取外・取付',
                'size'   => 1000, 
                'items' => []
            ],
            // 大型冷蔵庫運搬料
            [
                'ttl' => '大型冷蔵庫運搬料',
                'size'   => 4000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '家　具　設　置', 
        'items' => [
            // ベッド解体・組立
            [
                'ttl' => 'ベッド解体・組立',
                'items' => [
                    [
                        'ttl'    => '引出なし', 
                        'size'   => 2500
                    ],
                    [
                        'ttl'    => '引出あり', 
                        'size'   => 3500
                    ],
                    [
                        'ttl'    => '2段', 
                        'size'   => 4500
                    ],
                    [
                        'ttl'    => '油圧式', 
                        'size'   => 7000
                    ],
                ],
            ],
        ]
    ], 
    [
        'ttl'   => 'エアコンクリーニング', 
        'items' => [
            // 自動お掃除機能あり
            [
                'ttl' => '自動お掃除機能あり',
                'size'   => 18000, 
                'items' => []
            ],
            // 自動お掃除機能なし
            [
                'ttl' => '自動お掃除機能なし',
                'size'   => 12000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => 'リサイクル処分', 
        'items' => [
        ]
    ], 
    [
        'ttl'   => 'マットレス処分', 
        'items' => [
            // シングル（スプリング入り）
            [
                'ttl' => 'シングル（スプリング入り）',
                'size'   => 6000, 
                'items' => []
            ],
            // セミダブル（スプリング入り）
            [
                'ttl' => 'セミダブル（スプリング入り）',
                'size'   => 7000, 
                'items' => []
            ],
            // ダブル（スプリング入り）
            [
                'ttl' => 'ダブル（スプリング入り）',
                'size'   => 8000, 
                'items' => []
            ],
            // クイーン（スプリング入り）
            [
                'ttl' => 'クイーン（スプリング入り）',
                'size'   => 10000, 
                'items' => []
            ],
            // 折り畳み 薄型S（スプリングなし）
            [
                'ttl' => '折り畳み 薄型S（スプリングなし）',
                'size'   => 1000, 
                'items' => []
            ],
            // 折り畳み 薄型S（スプリングなし）
            [
                'ttl' => '折り畳み 薄型S（スプリングなし）',
                'size'   => 1000, 
                'items' => []
            ],
            // 高・低反発S（スプリングなし）
            [
                'ttl' => '高・低反発S（スプリングなし）',
                'size'   => 3000, 
                'items' => []
            ],
            // 高・低反発SW〜（スプリングなし）
            [
                'ttl' => '高・低反発SW〜（スプリングなし）',
                'size'   => 4000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '不用品回収', 
        'items' => [
        ]
    ], 
    [
        'ttl'   => 'エリア外対応', 
        'items' => [
        ]
    ], 
    [
        'ttl'   => '4階以上作業', 
        'items' => [
        ]
    ], 
];

// global $sel_pref_01, $sel_city_01, $sel_pref_02, $sel_city_02;

$sel_goods = [
];

$sel_options = [
];
?>