<?php
$address = [
    //大阪
    [
        'id' => 27, 
        'name' => '大阪', 
        'city' => [ '池田市', '泉大津市', '泉佐野市', '和泉市', '茨木市', '大阪狭山市', '大阪市旭区', '大阪市阿倍野区', '大阪市生野区', '大阪市北区', '大阪市此花区', '大阪市城東区', '大阪市住之江区', '大阪市住吉区', '大阪市大正区', '大阪市中央区', '大阪市鶴見区', '大阪市天王寺区', '大阪市浪速区', '大阪市西区', '大阪市西成区', '大阪市西淀川区', '大阪市東住吉区', '大阪市東成区', '大阪市東淀川区', '大阪市平野区', '大阪市福島区', '大阪市港区', '大阪市都島区', '大阪市淀川区', '貝塚市', '柏原市', '交野市', '門真市', '河内長野市', '岸和田市', '堺市北区', '堺市堺区', '堺市中区', '堺市西区', '堺市東区', '堺市南区', '堺市美原区', '四條畷市', '吹田市', '摂津市', '泉南郡熊取町', '泉南郡田尻町', '泉南郡岬町', '泉南市', '泉北市', '泉北郡忠岡市', '高石市', '高槻市', '大東市', '豊中市', '豊能郡豊能町', '豊能郡能勢町', '富田林市', '寝屋川市', '羽曳野市', '阪南市', '東大阪市', '枚方市', '藤井寺市', '松原市', '三島郡島本市', '南河内郡河南町', '南河内郡太子町', '南河内郡千早赤坂村', '箕面市', '守口市', '八尾市' ], 
    ], 
    //京都
    [
        'id' => 26, 
        'name' => '京都', 
        'city' => [ '綾部市', '宇治市', '乙訓郡大山崎町', '亀岡市', '京田辺市', '京丹後市', '京都市右京区', '京都市上京区', '京都市北区', '京都市左京区', '京都市下京区', '京都市中京区', '京都市西京区', '京都市東京区', '京都市伏見区', '京都市南区', '京都市山科区', '木津川区', '久世郡久御山町', '城陽市', '相楽郡笠置町', '相楽郡精華町', '相楽郡南山城村', '相楽郡和束町', '綴喜郡井手町', '綴喜郡宇治田原町', '長岡京市', '南丹市', '福知山市', '船井郡京丹波町', '舞鶴市', '宮津市', '向日市', '八幡市', '与謝郡伊根町', '与謝郡与謝野町' ], 
    ], 
    //兵庫
    [
        'id' => 28, 
        'name' => '兵庫', 
        'city' => [ '相生市', '明石市', '赤穂郡上郡町', '赤穂市', '朝来市', '芦屋市', '尼崎市', '淡路市', '伊丹市', '揖保郡太子町', '小野氏', '加古川市', '加古群稲美町', '加古郡播磨町', '加西市', '加東市', '川西市', '河辺郡猪名川町', '神崎郡市川町', '神崎郡神河町', '神崎郡福崎町', '神戸市北区', '神戸市須磨区', '神戸市垂水区', '神戸市中央区', '神戸市長田区', '神戸市灘区', '神戸市西区', '神戸市兵庫区', '神戸市東灘区', '篠山市', '佐用郡佐用町', '三田市', '穴粟市', '洲本市', '多可郡多可町', '高砂市', '宝塚市', 'たつの市', '丹波市', '豊岡市', '西宮市', '西脇市', '姫路市', '美方郡香美町', '美方郡新温泉町', '三木市', '南あわじ市', '養父市' ], 
    ], 
    //滋賀
    [
        'id' => 25, 
        'name' => '滋賀', 
        'city' => [ '犬上郡甲良町', '犬上郡多賀町', '犬上郡豊郷町', '愛知郡愛荘町', '近江八幡市', '大津市', '蒲生郡日野町', '蒲生郡竜王町', '草津市', '甲賀市', '湖南市', '高島市', '長浜市', '東近江市', '彦根市', '米原氏', '守山市', '野洲市', '粟東市' ], 
    ], 
    //奈良
    [
        'id' => 29, 
        'name' => '奈良', 
        'city' => [ '生駒郡安堵町', '生駒郡斑鳩町', '生駒郡三郷町', '生駒郡平群町', '生駒市', '宇陀郡曽爾村', '宇陀郡御杖村', '宇陀市', '橿原市', '香芝市', '葛城市', '北葛城郡王寺町', '北葛城郡河合町', '北葛城郡上牧町', '北葛城郡広陵町', '五條市', '御所市', '桜井市', '磯城郡川西町', '磯城郡田原本町', '磯城郡三宅町', '高市郡明日香村', '高市郡高取町', '天理市', '奈良市', '大和郡山市', '大和高田市', '山辺郡山添村', '吉野郡大淀町', '吉野郡上北山村', '吉野郡川上村', '吉野郡黒滝村', '吉野郡下市町', '吉野郡下北山村', '吉野郡天川村', '吉野郡十津川村', '吉野郡野迫川村', '吉野郡東吉野村', '吉野郡吉野村' ], 
    ], 
    //和歌山
    [
        'id' => 30, 
        'name' => '和歌山', 
        'city' => [ '有田郡有田川町', '有田郡広川町', '有田郡湯浅町', '有田市', '伊都郡かつらぎ町', '伊都郡九度山町', '伊都郡高野町', '岩出市', '海草郡紀美野町', '海南市', '紀の川市', '御坊市', '新宮市', '田辺市', '西牟婁郡上富田町', '西牟婁郡白浜町', '西牟婁郡すさみ町', '橋本市', '東牟婁郡北山村', '東牟婁郡串本町', '東牟婁郡古座川町', '東牟婁郡太地町', '東牟婁郡那智勝浦町', '日高郡印南町', '日高郡日高川町', '日高郡日高町', '日高郡みなべ町', '日高郡美浜町', '日高郡由良町', '和歌山市' ], 
    ], 
    //三重
    [
        'id' => 24, 
        'name' => '三重', 
        'city' => [ '伊賀市', '伊勢市', '員弁郡東員町', 'いなべ市', '尾鷲市', '亀山市', '北牟婁郡紀北町', '熊野市', '桑名郡木曽岬町', '桑名市', '志摩市', '鈴鹿市', '多気郡大台町', '多気郡多気町', '多気郡明和町', '津　市', '鳥羽市', '名張市', '松阪市', '三重郡朝日町', '三重郡川越町', '三重郡菰野町', '南牟婁郡紀宝町', '南牟婁郡御浜町', '四日市市', '度会郡大紀町', '度会郡玉城町', '度会郡南伊勢町', '度会郡度会町' ], 
    ], 

    //愛媛
    [
        'id' => 38, 
        'name' => '愛媛', 
        'city' => [ '今治市', '伊予郡砥部町', '伊予郡松前町', '伊予市', '宇和島市', '大洲市', '越智郡上島町', '上浮穴郡久万高原町', '北宇和郡鬼北町', '北宇和郡松野町', '喜多郡内子町', '西条市', '四国中央市', '西予市', '東温市', '新居浜市', '西宇和郡伊方町', '松山市', '南宇和郡愛南町', '八幡浜市' ], 
    ], 
    //香川
    [
        'id' => 37, 
        'name' => '香川', 
        'city' => [ '綾歌郡綾川町', '綾歌郡宇多津町', '香川郡直島町', '観音寺市', '木田郡三木町', '坂出市', 'さぬき市', '小豆郡小豆島町', '小豆郡土庄町', '善通寺市', '高松市', '仲多度郡琴平町', '仲多度郡多度津町', '東かがわ市', '丸亀市', '三豊市' ], 
    ], 
    //徳島
    [
        'id' => 36, 
        'name' => '徳島', 
        'city' => [ '阿南市', '阿波市', '板野郡藍住町', '板野郡板野町', '板野郡上板町', '板野郡北島町', '板野郡松茂町', '海部郡海陽町', '海部郡美波町', '海部郡牟岐町', '勝浦郡勝浦町', '勝浦郡上勝町', '小松島市', '徳島市', '那賀郡那賀町', '鳴門市', '名西郡石井町', '名西郡神山町', '名東郡佐那河内村', '美馬郡つるぎ町', '三好市', '吉野川市' ], 
    ], 
    //高知
    [
        'id' => 39, 
        'name' => '高知', 
        'city' => [ '吾川郡いの町', '吾川郡仁淀川町', '安芸郡馬路村', '安芸郡北川村', '安芸郡芸西村', '安芸郡田野町', '安芸郡東洋町', '安芸郡奈半利町', '安芸郡安田町', '安芸市', '香美市', '高知市', '香南市', '四万十市', '宿毛市', '須崎市', '高岡郡越知町', '高岡郡佐川町', '高岡郡四万十町', '高岡郡津野町', '高岡郡中土佐町', '高岡郡日高村', '土佐郡大川村', '土佐郡土佐町', '土佐市', '土佐清水市', '長岡郡大豊町', '長岡郡本山町', '南国市', '幡多郡大月町', '幡多郡黒潮町', '幡多郡三原村', '室戸市' ], 
    ], 

    //広島
    [
        'id' => 34, 
        'name' => '広島', 
        'city' => [ '安芸郡海田町', '安芸郡熊野町', '安芸郡坂町', '安芸郡府中町', '安芸高田市', '江田島市', '大竹市', '尾道市', '呉市', '庄原市', '神石郡神石高原町', '世羅郡世羅町', '竹原市', '豊田郡大崎上島町', '廿日市市', '東広島市', '広島市安芸区', '広島市安佐北区', '広島市安佐南区', '広島市佐伯区', '広島市中区', '広島市西区', '広島市東区', '広島市南区', '福山市', '府中市', '三原市', '三次市', '山県郡安芸太田町', '山県郡北広島町' ], 
    ], 
    //岡山
    [
        'id' => 33, 
        'name' => '岡山', 
        'city' => [ '英田郡西粟倉村', '赤磐市', '浅口郡里庄町', '浅口市', '井原市', '岡山市北区', '岡山市中区', '岡山市東区', '岡山市南区', '小田郡矢掛町', '加賀郡吉備中央町', '笠岡市', '勝田郡勝央町', '勝田郡奈義町', '久米郡久米南町', '久米郡美咲町', '倉敷市', '瀬戸内市', '総社市', '高梁市', '玉野市', '都窪郡早島町', '津山市', '苫田郡鏡野町', '新見市', '備前市', '真庭郡新庄村', '真庭市', '美作市', '和気郡和気町' ], 
    ], 
    //山口
    [
        'id' => 35, 
        'name' => '山口', 
        'city' => [ '阿武郡阿武町', '岩国市', '宇部市', '大島郡周防大島町', '玖珂郡和木町', '下松市', '毛郡田上関町', '毛郡田布施町', '熊毛郡平生町', '山陽小野田市', '周南市', '下関市', '長門市', '萩市', '光市', '防府市', '美祢市', '柳井市', '山口市' ],
    ], 
    //鳥取
    [
        'id' => 31, 
        'name' => '鳥取', 
        'city' => [ '岩美郡岩美町', '倉吉市', '西伯郡大山町', '西伯郡南部町', '西伯郡日吉津村', '西伯郡伯耆町', '境港市', '鳥取市', '東伯郡琴浦町', '東伯郡北栄町', '東伯郡三朝町', '東伯郡湯梨浜町', '日野郡江府町', '日野郡日南町', '日野郡日野町', '八頭郡智頭町', '八頭郡八頭町', '八頭郡若桜町', '米子' ], 
    ], 
    //島根
    [
        'id' => 32, 
        'name' => '島根', 
        'city' => [ '飯石郡飯南町', '出雲市', '大田市', '邑智郡邑南町', '邑智郡川本町', '邑智郡美郷町', '隠岐郡隠岐の島町', '隠岐郡知夫村', '隠岐郡西ﾉ島町', '鹿足郡津和野町', '鹿足郡吉賀町', '江津市', '仁多郡奥出雲町', '浜田市', '益田市', '松江市', '安来市' ], 
    ], 

    //福岡
    [
        'id' => 40, 
        'name' => '福岡', 
        'city' => [ '朝倉郡筑前町', '朝倉郡東峰村', '朝倉市', '飯塚市', '糸島市', 'うきは市', '大川市', '大野城市', '大牟田市', '小郡市', '遠賀郡芦屋町', '遠賀郡岡垣町', '遠賀郡遠賀町', '遠賀郡水巻町', '春日市', '糟屋郡宇美町', '糟屋郡粕屋町', '糟屋郡篠栗町', '糟屋郡志免町', '糟屋郡新宮町', '糟屋郡須恵町', '糟屋郡久山町', '嘉穂郡桂川町', '嘉麻市', '北九州市小倉北区', '北九州市小倉南区', '北九州市戸畑区', '北九州市門司区', '北九州市八幡西区', '北九州市八幡東区', '北九州市若松区', '鞍手郡鞍手町', '鞍手郡小竹町', '久留米市', '古賀市', '田川郡赤村', '田川郡糸田町', '田川郡大任町', '田川郡川崎町', '田川郡香春町', '田川郡添田町', '田川郡福智町', '田川市', '太宰府市', '筑後市', '筑紫野市', '築上郡上毛町', '築上郡築上町', '築上郡吉富町', '那珂川町', '中間市', '直方市', '福岡市早良区', '福岡市城南区', '福岡市中央区', '福岡市西区', '福岡市博多区', '福岡市東区', '福岡市南区', '福津市', '豊前市', '三井郡大刀洗町', '三潴郡大木町', '京都郡苅田町', '京都郡みやこ町', 'みやま市', '宮若市', '宗像市', '柳川市', '八女郡広川町', '八女市', '行橋市' ], 
    ], 
    //佐賀
    [
        'id' => 41, 
        'name' => '佐賀', 
        'city' => [ '伊万里市', '嬉野市', '小城市', '鹿島市', '唐津市', '神埼郡吉野ヶ里町', '神埼市', '杵島郡大町町', '杵島郡江北町', '杵島郡白石町', '佐賀市', '多久市', '武雄市', '鳥栖市', '西松浦郡有田町', '東松浦郡玄海町', '藤津郡太良町', '三養基郡上峰町', '三養基郡基山町', '三養基郡みやき町' ], 
    ], 
    //長崎
    [
        'id' => 42, 
        'name' => '長崎', 
        'city' => [ '壱岐市', '諫早市', '雲仙市', '大村市', '北松浦郡小値賀町', '北松浦郡佐々町', '五島市', '西海市', '佐世保市', '島原市', '対馬市', '長崎市', '西彼杵郡時津町', '西彼杵郡長与町', '東彼杵郡川棚町', '東彼杵郡波佐見町', '東彼杵郡東彼杵町', '平戸市', '松浦市', '南島原市', '南松浦郡新上五島町' ], 
    ], 
    //熊本
    [
        'id' => 43, 
        'name' => '熊本', 
        'city' => [ '葦北郡芦北町', '葦北郡津奈木町', '阿蘇郡産山村', '阿蘇郡小国町', '阿蘇郡高森町', '阿蘇郡南阿蘇村', '阿蘇郡小国町', '阿蘇市', '天草郡苓北町', '天草市', '荒尾市', '宇城市', '宇土市', '上天草市', '上益城郡嘉島町', '上益城郡甲佐町', '上益城郡益城町', '上益城郡御船町', '上益城郡山都町', '菊池郡大津町', '菊池郡菊陽町', '菊池市', '球磨郡あさぎり町', '球磨郡五木村', '球磨郡球磨村', '球磨郡相良村', '球磨郡多良木町', '球磨郡錦町', '球磨郡水上村', '球磨郡山江村', '球磨郡湯前町', '熊本市北区', '熊本市中央区', '熊本市西区', '熊本市東区', '熊本市南区', '合志市', '下益城郡美里町', '玉名郡玉東町', '玉名郡長洲町', '玉名郡和水町', '玉名郡南関町', '玉名市', '人吉市', '水俣市', '八代郡氷川町', '八代市', '山鹿市' ], 
    ], 
    //大分
    [
        'id' => 44, 
        'name' => '大分', 
        'city' => [ '宇佐市', '臼杵市', '大分市', '杵築市', '玖珠郡玖珠町', '玖珠郡九重町', '国東市', '佐伯市', '竹田市', '津久見市', '中津市', '速見郡日出町', '東国東郡姫島村', '日田市', '豊後大野市', '豊後高田市', '別府市', '由布市' ], 
    ], 
    //宮崎
    [
        'id' => 45, 
        'name' => '宮崎', 
        'city' => [ 'えびの市', '北諸県郡三股町', '串間市', '小林市', '児湯郡川南町', '児湯郡木城町', '児湯郡新富町', '児湯郡高鍋町', '児湯郡都農町', '児湯郡西米良村', '西都市', '西臼杵郡五ヶ瀬町', '西臼杵郡高千穂町', '西臼杵郡日之影町', '西諸県郡高原町', '日南市', '延岡市', '日向市', '東臼杵郡門川町', '東臼杵郡椎葉村', '東臼杵郡美郷町', '東臼杵郡諸塚村', '東諸県郡綾町', '東諸県郡国富町', '都城市', '宮崎市' ], 
    ], 
    //鹿児島
    [
        'id' => 46, 
        'name' => '鹿児島', 
        'city' => [ '姶良郡湧水町', '姶良市', '阿久根市', '奄美市', '伊佐市', '出水郡長島町', '出水市', 'いちき串木野市', '指宿市', '大島郡天城町', '大島郡伊仙町', '大島郡宇検村', '大島郡喜界町', '大島郡瀬戸内町', '大島郡龍郷町', '大島郡知名町', '大島郡徳之島町', '大島郡大和村', '大島郡与論町', '大島郡和泊町', '鹿児島郡十島村', '鹿児島郡三島村', '鹿児島市', '肝属郡肝付町', '肝属郡錦江町', '肝属郡東串良町', '肝属郡南大隅町', '霧島市', '熊毛郡中種子町', '熊毛郡南種子町', '熊毛郡屋久島町', '薩摩郡さつま町', '薩摩川内市', '志布志市', '曽於郡大崎町', '曽於市', '西之表市', '日置市', '枕崎市', '南九州市', '南さつま市' ]
    ], 
];

$goods = [
    [
        'ttl'   => '家　電', 
        'items' => [
            [
                'ttl' => '冷蔵庫',
                'img' => 'kaden/reizouko-s.png', 
                'items' => [
                    [
                        'idx'    => 0, 
                        'ttl'    => '100〜200L未満', 
                        'full_ttl'    => '冷蔵庫 [100〜200L未満]', 
                        'len_01' => 50, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 250000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 1, 
                        'ttl'    => '200〜400L未満', 
                        'full_ttl'    => '冷蔵庫 [200〜400L未満]', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 160, 
                        'size'   => 576000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 2, 
                        'ttl'    => '400〜500L未満', 
                        'full_ttl'    => '冷蔵庫 [400〜500L未満]', 
                        'len_01' => 60, 
                        'len_02' => 65, 
                        'len_03' => 180, 
                        'size'   => 702000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 3, 
                        'ttl'    => '500L以上', 
                        'full_ttl'    => '冷蔵庫 [500L以上]', 
                        'len_01' => 60, 
                        'len_02' => 75, 
                        'len_03' => 180, 
                        'size'   => 877500,
                        'single' => false,
                    ], 
                ]
            ],
            // 洗濯機
            [
                'ttl' => '洗濯機',
                'img' => 'kaden/sentakuki.png', 
                'items' => [
                    [
                        'idx'    => 4, 
                        'ttl'    => '4kg〜8kg', 
                        'full_ttl'    => '洗濯機 [4kg〜8kg]', 
                        'len_01' => 55, 
                        'len_02' => 55, 
                        'len_03' => 85, 
                        'size'   => 257125,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 5, 
                        'ttl'    => '9kg以上', 
                        'full_ttl'    => '洗濯機 [9kg以上]', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 90, 
                        'size'   => 324000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 6, 
                        'ttl'    => 'ドラム式', 
                        'full_ttl'    => '洗濯機 [ドラム式]', 
                        'len_01' => 60, 
                        'len_02' => 70, 
                        'len_03' => 110, 
                        'size'   => 462000,
                        'single' => false,
                    ], 
                ]
            ],
            [
                'idx'    => 7, 
                'ttl' => 'レンジ',
                'img' => 'kaden/renji.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'single' => true,
                'items' => []
            ],
            [
                'ttl' => 'エアコン',
                'img' => 'kaden/eakon.png', 
                'items' => [
                    [
                        'idx'    => 8, 
                        'ttl'    => '一般', 
                        'full_ttl'    => 'エアコン [一般]', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 90, 
                        'size'   => 216000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 9, 
                        'ttl'    => '窓用', 
                        'full_ttl'    => 'エアコン [窓用]', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 100, 
                        'size'   => 240000,
                        'single' => false,
                    ], 
                ]
            ],
            [
                'idx'    => 10, 
                'ttl' => 'ファンヒーター',
                'img' => 'kaden/pensutando.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'single' => false,
                'items' => []
            ],
            [
                'ttl' => 'こたつ',
                'img' => 'kaden/kotatu.png', 
                'items' => [
                    [
                        'idx'    => 11, 
                        'ttl'    => '正方形', 
                        'full_ttl'    => 'こたつ [正方形]', 
                        'len_01' => 75, 
                        'len_02' => 75, 
                        'len_03' => 40, 
                        'size'   => 225000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 12, 
                        'ttl'    => '長方形', 
                        'full_ttl'    => 'こたつ [長方形]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 40, 
                        'size'   => 240000,
                        'single' => false,
                    ], 
                ]
            ],
            [
                'idx'    => 13, 
                'ttl' => '空気清浄機',
                'img' => 'kaden/kuukiseijyouki.png', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'single' => false,
                'items' => []
            ],
            [
                'idx'    => 14, 
                'ttl' => 'ウォーターサーバー',
                'img' => 'kaden/woterserver.png', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 150, 
                'size'   => 240000, 
                'single' => false,
                'items' => []
            ],
            [
                'idx'    => 15, 
                'ttl' => '掃除機',
                'img' => 'kaden/soujiki.png', 
                'len_01' => 30, 
                'len_02' => 30, 
                'len_03' => 90, 
                'size'   => 81000, 
                'single' => true,
                'items' => []
            ],
            [
                'idx'    => 16, 
                'ttl' => '扇風機',
                'img' => 'kaden/senpuuki.png', 
                'len_01' => 40, 
                'len_02' => 30, 
                'len_03' => 70, 
                'size'   => 84000, 
                'single' => false,
                'items' => []
            ],
            [
                'idx'    => 17, 
                'ttl' => 'ガスコンロ',
                'img' => 'kaden/konro.png', 
                'len_01' => 55, 
                'len_02' => 40, 
                'len_03' => 25, 
                'size'   => 55000, 
                'single' => true,
                'items' => []
            ],
            [
                'idx'    => 18, 
                'ttl' => 'オーブントースター',
                'img' => '', 
                'len_01' => 35, 
                'len_02' => 25, 
                'len_03' => 30, 
                'size'   => 26250, 
                'single' => false,
                'items' => []
            ],
            [
                'idx'    => 19, 
                'ttl' => '炊飯器',
                'img' => '', 
                'len_01' => 25, 
                'len_02' => 35, 
                'len_03' => 20, 
                'size'   => 17500, 
                'single' => false,
                'items' => []
            ],
            [
                'idx'    => 20, 
                'ttl' => 'ポット',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 30, 
                'len_03' => 25, 
                'size'   => 15000, 
                'single' => false,
                'items' => []
            ],
            // 照明器具
            [
                'idx'    => 21, 
                'ttl' => '照明器具',
                'img' => 'kaden/siiringulight.png', 
                'len_01' => 50, 
                'len_02' => 50, 
                'len_03' => 30, 
                'size'   => 75000, 
                'single' => false,
                'items' => []
            ],
            // アイロン
            [
                'idx'    => 22, 
                'ttl' => 'アイロン',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 30, 
                'len_03' => 20, 
                'size'   => 12000, 
                'single' => false,
                'items' => []
            ],
            // アイロン台
            [
                'idx'    => 23, 
                'ttl' => 'アイロン台',
                'img' => '', 
                'len_01' => 73, 
                'len_02' => 45, 
                'len_03' => 20, 
                'size'   => 65700, 
                'single' => false,
                'items' => []
            ],
            // 電気ストーブ
            [
                'ttl' => '電気ストーブ',
                'img' => '', 
                'items' => [
                    [
                        'idx'    => 24, 
                        'ttl'    => '電気ストーブ(小)', 
                        'full_ttl'    => '電気ストーブ(小)', 
                        'len_01' => 30, 
                        'len_02' => 20, 
                        'len_03' => 40, 
                        'size'   => 24000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 25, 
                        'ttl'    => '電気ストーブ(小)', 
                        'full_ttl'    => '電気ストーブ(小)', 
                        'len_01' => 30, 
                        'len_02' => 20, 
                        'len_03' => 40, 
                        'size'   => 24000,
                        'single' => false,
                    ], 
                ]
            ],
            // ミシン
            [
                'idx'    => 26, 
                'ttl' => 'ミシン',
                'img' => '', 
                'len_01' => 50, 
                'len_02' => 20, 
                'len_03' => 30, 
                'size'   => 30000, 
                'single' => false,
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '家　具',
        'items' => [
            // 洋タンス（ワードロ－プ）
            [
                'ttl' => '洋タンス（ワードロ－プ）',
                'img' => 'kagu/youdansu.png', 
                'items' => [
                    [
                        'idx'    => 27, 
                        'ttl'    => '扉2枚タイプ', 
                        'full_ttl'    => '洋タンス [扉2枚タイプ]', 
                        'len_01' => 100, 
                        'len_02' => 70, 
                        'len_03' => 210, 
                        'size'   => 1470000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 28, 
                        'ttl'    => '扉3枚タイプ', 
                        'full_ttl'    => '洋タンス [扉3枚タイプ]', 
                        'len_01' => 140, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 1764000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 29, 
                        'ttl'    => '扉4枚タイプ', 
                        'full_ttl'    => '洋タンス [扉4枚タイプ]', 
                        'len_01' => 160, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 2016000,
                        'single' => false,
                    ], 
                ]
            ],
            // 和ダンス            
            [
                'ttl' => '和ダンス・5段引き出し',
                'img' => 'kagu/wadansu.jpg', 
                'items' => [
                    [
                        'idx'    => 30, 
                        'ttl'    => 'W100', 
                        'full_ttl'    => '和ダンス・5段引き出し [W100]', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 500000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 31, 
                        'ttl'    => 'W120', 
                        'full_ttl'    => '和ダンス・5段引き出し [W120]', 
                        'len_01' => 120, 
                        'len_02' => 60, 
                        'len_03' => 130, 
                        'size'   => 936000,
                        'single' => false,
                    ], 
                ]
            ],
            // 整理ダンス
            [
                'ttl' => '整理ダンス',
                'img' => 'kagu/seiridansu.png', 
                'items' => [
                    [
                        'idx'    => 32, 
                        'ttl'    => '引出3段以下', 
                        'full_ttl'    => '整理ダンス [引出3段以下]', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 60, 
                        'size'   => 396000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 33, 
                        'ttl'    => '引出5段以下', 
                        'full_ttl'    => '整理ダンス [引出5段以下]', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 110, 
                        'size'   => 726000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 34, 
                        'ttl'    => '引出6段以上', 
                        'full_ttl'    => '整理ダンス [引出6段以上]', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 150, 
                        'size'   => 990000,
                        'single' => false,
                    ], 
                ]
            ],
            // ベッド
            [
                'ttl' => 'ベッド',
                'img' => 'kagu/bed.png', 
                'items' => [
                    [
                        'idx'    => 35, 
                        'ttl'    => 'シングル', 
                        'full_ttl'    => 'ベッド [シングル]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1260000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 36, 
                        'ttl'    => 'セミダブル', 
                        'full_ttl'    => 'ベッド [セミダブル]', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1312500,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 37, 
                        'ttl'    => 'ダブル', 
                        'full_ttl'    => 'ベッド [ダブル]', 
                        'len_01' => 165, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1732500,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 38, 
                        'ttl'    => 'クイーン', 
                        'full_ttl'    => 'ベッド [クイーン]', 
                        'len_01' => 180, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1890000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 39, 
                        'ttl'    => 'ダブル二つ折り', 
                        'full_ttl'    => 'ベッド [ダブル二つ折り]', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 687500,
                        'single' => false,
                    ], 
                ]
            ],
            // マットレス
            [
                'ttl' => 'マットレス',
                'img' => 'kagu/mattoresu.jpg', 
                'items' => [
                    [
                        'idx'    => 40, 
                        'ttl'    => 'シングル', 
                        'full_ttl'    => 'マットレス [シングル]', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1000000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 41, 
                        'ttl'    => 'セミダブル', 
                        'full_ttl'    => 'マットレス [セミダブル]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1200000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 42, 
                        'ttl'    => 'ダブル', 
                        'full_ttl'    => 'マットレス [ダブル]', 
                        'len_01' => 140, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1400000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 43, 
                        'ttl'    => 'クイーン', 
                        'full_ttl'    => 'マットレス [クイーン]', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1600000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 44, 
                        'ttl'    => '折り畳み', 
                        'full_ttl'    => 'マットレス [折り畳み]', 
                        'len_01' => 100, 
                        'len_02' => 60, 
                        'len_03' => 70, 
                        'size'   => 420000,
                        'single' => false,
                    ], 
                ]
            ],
            // メタルラック（分解可）
            [
                'ttl' => 'メタルラック（分解可）',
                'img' => 'kagu/', 
                'items' => [
                    [
                        'idx'    => 45, 
                        'ttl'    => '横幅60以下', 
                        'full_ttl'    => 'メタルラック（分解可） [横幅60以下]', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 648000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 46, 
                        'ttl'    => '横幅90以下', 
                        'full_ttl'    => 'メタルラック（分解可） [横幅90以下]', 
                        'len_01' => 90, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 972000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 47, 
                        'ttl'    => '横幅120以上', 
                        'full_ttl'    => 'メタルラック（分解可） [横幅120以上]', 
                        'len_01' => 180, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 1944000,
                        'single' => false,
                    ], 
                ]
            ],
            // ローボード
            [
                'idx'    => 48, 
                'ttl' => 'ローボード',
                'img' => 'kagu/ro-bord.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 50, 
                'size'   => 225000, 
                'single' => true,
                'items' => []
            ],
            // 姿見
            [
                'idx'    => 49, 
                'ttl' => '姿見',
                'img' => 'kagu/sugatami.png', 
                'len_01' => 30, 
                'len_02' => 190, 
                'len_03' => 20, 
                'size'   => 114000, 
                'single' => true,
                'items' => [],
            ],
            // ドレッサー
            [
                'ttl' => 'ドレッサー',
                'img' => 'kagu/doressa-.png', 
                'items' => [
                    [
                        'idx'    => 50, 
                        'ttl'    => '横幅60以下', 
                        'full_ttl'    => 'ドレッサー [横幅60以下]', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 216000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 51, 
                        'ttl'    => '横幅90以下', 
                        'full_ttl'    => 'ドレッサー [横幅90以下]', 
                        'len_01' => 90, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 324000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 52, 
                        'ttl'    => '横幅91以上', 
                        'full_ttl'    => 'ドレッサー [横幅91以上]', 
                        'len_01' => 120, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 432000,
                        'single' => false,
                    ], 
                ]
            ],
            // 本棚
            [
                'ttl' => '本棚',
                'img' => 'kagu/hondana.png', 
                'items' => [
                    [
                        'idx'    => 53, 
                        'ttl'    => '100cm以下', 
                        'full_ttl'    => '本棚 [100cm以下]', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 350000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 54, 
                        'ttl'    => '150cm以下', 
                        'full_ttl'    => '本棚 [150cm以下]', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 150, 
                        'size'   => 525000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 55, 
                        'ttl'    => '180cm以下', 
                        'full_ttl'    => '本棚 [180cm以下]', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 180, 
                        'size'   => 630000,
                        'single' => false,
                    ], 
                ]
            ],
            // カーペット（6畳まで）
            [
                'idx'    => 56, 
                'ttl' => 'カーペット（6畳まで）',
                'img' => 'kagu/karpet.png', 
                'len_01' => 360, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 576000, 
                'single' => true,
                'items' => []
            ],
            // 学習机
            [
                'ttl' => '学習机',
                'img' => 'kagu/gakusyudukue.jpg', 
                'items' => [
                    [
                        'idx'    => 57, 
                        'ttl'    => '本体のみ', 
                        'full_ttl'    => '学習机 [本体のみ]', 
                        'len_01' => 110, 
                        'len_02' => 75, 
                        'len_03' => 75, 
                        'size'   => 618750,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 58, 
                        'ttl'    => '脇棚', 
                        'full_ttl'    => '学習机 [脇棚]', 
                        'len_01' => 50, 
                        'len_02' => 70, 
                        'len_03' => 75, 
                        'size'   => 262500,
                        'single' => false,
                    ], 
                ]
            ],
            // 机用椅子
            [
                'idx'    => 59, 
                'ttl' => '机用椅子',
                'img' => 'kagu/tukueyouisu.jpg', 
                'len_01' => 40, 
                'len_02' => 60, 
                'len_03' => 95, 
                'size'   => 228000, 
                'single' => false,
                'items' => []
            ],
            // ソファー
            [
                'ttl' => 'ソファー',
                'img' => 'kagu/sofa.png', 
                'items' => [
                    [
                        'idx'    => 60, 
                        'ttl'    => '1人掛け', 
                        'full_ttl'    => 'ソファー [1人掛け]', 
                        'len_01' => 80, 
                        'len_02' => 90, 
                        'len_03' => 50, 
                        'size'   => 648000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 61, 
                        'ttl'    => '2人掛け', 
                        'full_ttl'    => 'ソファー [2人掛け]', 
                        'len_01' => 150, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1080000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 62, 
                        'ttl'    => '3人掛け', 
                        'full_ttl'    => 'ソファー [3人掛け]', 
                        'len_01' => 240, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1728000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 63, 
                        'ttl'    => 'L字型', 
                        'full_ttl'    => 'ソファー [L字型]', 
                        'len_01' => 390, 
                        'len_02' => 160, 
                        'len_03' => 180, 
                        'size'   => 11232000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 64, 
                        'ttl'    => 'オットマン', 
                        'full_ttl'    => 'ソファー [オットマン]', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 40, 
                        'size'   => 256000,
                        'single' => false,
                    ], 
                ]
            ],
            // リビングテーブル
            [
                'ttl' => 'リビングテーブル',
                'img' => 'kagu/ribingute-buru.png', 
                'items' => [
                    [
                        'idx'    => 65, 
                        'ttl'    => '横幅100cmまで', 
                        'full_ttl'    => 'リビングテーブル [横幅100cmまで]', 
                        'len_01' => 100, 
                        'len_02' => 75, 
                        'len_03' => 55, 
                        'size'   => 412500,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 66, 
                        'ttl'    => '横幅100cm以上', 
                        'full_ttl'    => 'リビングテーブル [横幅100cm以上]', 
                        'len_01' => 160, 
                        'len_02' => 70, 
                        'len_03' => 55, 
                        'size'   => 616000,
                        'single' => false,
                    ], 
                ]
            ],
            // 食器棚（分解可能）
            [
                'ttl' => '食器棚（分解可能）',
                'img' => 'kagu/syokkidana.png', 
                'items' => [
                    [
                        'idx'    => 67, 
                        'ttl'    => '横幅90cm以下', 
                        'full_ttl'    => '食器棚（分解可能） [横幅90cm以下]', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 832500,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 68, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => '食器棚（分解可能） [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1110000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 69, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => '食器棚（分解可能） [横幅121cm以上]', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1387500,
                        'single' => false,
                    ], 
                ]
            ],
            // 食器棚（分解不可）
            [
                'idx'    => 70, 
                'ttl' => '食器棚（分解不可）',
                'img' => 'kagu/syokkidana2.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 190, 
                'size'   => 855000, 
                'single' => false,
                'items' => []
            ],
            // 食卓テーブル
            [
                'ttl' => '食卓テーブル',
                'img' => 'kagu/syokutakute-buru.png', 
                'items' => [
                    [
                        'idx'    => 71, 
                        'ttl'    => '横幅90cm以下', 
                        'full_ttl'    => '食卓テーブル [横幅90cm以下]', 
                        'len_01' => 90, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 792000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 72, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => '食卓テーブル [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1056000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 73, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => '食卓テーブル [横幅121cm以上]', 
                        'len_01' => 160, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1408000,
                        'single' => false,
                    ], 
                ]
            ],
            // 椅子
            [
                'idx'    => 74, 
                'ttl' => '椅子',
                'img' => 'kagu/isu.png', 
                'len_01' => 40, 
                'len_02' => 50, 
                'len_03' => 90, 
                'size'   => 180000, 
                'single' => false,
                'items' => []
            ], 
            // ローテーブル
            [
                'ttl' => 'ローテーブル',
                'img' => 'kagu/ro-te-buru.jpg', 
                'items' => [
                    [
                        'idx'    => 75, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => 'ローテーブル [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 76, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => 'ローテーブル [横幅121cm以上]', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 375000,
                        'single' => false,
                    ], 
                ]
            ],
            // カーペット(丸巻き)
            [
                'idx'    => 77, 
                'ttl' => 'カーペット(丸巻き)',
                'img' => '', 
                'len_01' => 350, 
                'len_02' => 25, 
                'len_03' => 25, 
                'size'   => 218750, 
                'single' => false,
                'items' => []
            ],
            // 飾り棚（ガラス）
            [
                'idx'    => 78, 
                'ttl' => '飾り棚（ガラス）',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 35, 
                'len_03' => 165, 
                'size'   => 231000, 
                'single' => false,
                'items' => []
            ],
            // ハンガーパイプ
            [
                'idx'    => 79, 
                'ttl' => 'ハンガーパイプ',
                'img' => '', 
                'len_01' => 80, 
                'len_02' => 40, 
                'len_03' => 160, 
                'size'   => 512000, 
                'single' => false,
                'items' => []
            ],
            // ハンガーボックス
            [
                'idx'    => 80, 
                'ttl' => 'ハンガーボックス',
                'img' => '', 
                'len_01' => 50, 
                'len_02' => 50, 
                'len_03' => 100, 
                'size'   => 250000, 
                'single' => false,
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => 'AV・PC',
        'items' => [
            // ブラウン管テレビ
            [
                'ttl' => 'ブラウン管テレビ',
                'img' => 'avpc/buraunkan.jpg', 
                'items' => [
                    [
                        'idx'    => 81, 
                        'ttl'    => '21未満', 
                        'full_ttl'    => 'ブラウン管テレビ [21未満]', 
                        'len_01' => 50, 
                        'len_02' => 60, 
                        'len_03' => 50, 
                        'size'   => 150000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 82, 
                        'ttl'    => '21以上50未満', 
                        'full_ttl'    => 'ブラウン管テレビ [21以上50未満]', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 80, 
                        'size'   => 512000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 83, 
                        'ttl'    => '50以上', 
                        'full_ttl'    => 'ブラウン管テレビ [50以上]', 
                        'len_01' => 100, 
                        'len_02' => 100, 
                        'len_03' => 100, 
                        'size'   => 1000000,
                        'single' => false,
                    ], 
                ]
            ],
            // 液晶テレビ
            [
                'ttl' => '液晶テレビ',
                'img' => 'avpc/tv.png', 
                'items' => [
                    [
                        'idx'    => 84, 
                        'ttl'    => '32未満', 
                        'full_ttl'    => '液晶テレビ [32未満]', 
                        'len_01' => 70, 
                        'len_02' => 40, 
                        'len_03' => 40, 
                        'size'   => 112000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 85, 
                        'ttl'    => '32以上50未満', 
                        'full_ttl'    => '液晶テレビ [32以上50未満]', 
                        'len_01' => 110, 
                        'len_02' => 40, 
                        'len_03' => 60, 
                        'size'   => 264000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 86, 
                        'ttl'    => '50以上', 
                        'full_ttl'    => '液晶テレビ [50以上]', 
                        'len_01' => 150, 
                        'len_02' => 60, 
                        'len_03' => 80, 
                        'size'   => 720000,
                        'single' => false,
                    ], 
                ]
            ], 
            // テレビ台（ロータイプ）
            [
                'ttl' => 'テレビ台（ロータイプ）',
                'img' => 'avpc/tv-dai.png', 
                'items' => [
                    [
                        'idx'    => 87, 
                        'ttl'    => '横幅90cm以下', 
                        'full_ttl'    => 'テレビ台（ロータイプ） [横幅90cm以下]', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 225000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 88, 
                        'ttl'    => '横幅120cm以下', 
                        'full_ttl'    => 'テレビ台（ロータイプ） [横幅120cm以下]', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 89, 
                        'ttl'    => '横幅121cm以上', 
                        'full_ttl'    => 'テレビ台（ロータイプ） [横幅121cm以上]', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 400000,
                        'single' => false,
                    ], 
                ]
            ], 
            // テレビ台（特大）
            [
                'idx'    => 90, 
                'ttl' => 'テレビ台（特大）',
                'img' => 'avpc/tv-dai-tokudai.jpg', 
                'len_01' => 180, 
                'len_02' => 60, 
                'len_03' => 180, 
                'size'   => 1944000, 
                'single' => false,
                'items' => []
            ], 
            // デスクトップパソコン
            [
                'idx'    => 91, 
                'ttl' => 'デスクトップパソコン',
                'img' => 'avpc/pc.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 80000, 
                'single' => false,
                'items' => []
            ], 
            // パソコンラック
            [
                'idx'    => 92, 
                'ttl' => 'パソコンラック',
                'img' => 'avpc/pc-rack.png', 
                'len_01' => 60, 
                'len_02' => 50, 
                'len_03' => 110, 
                'size'   => 330000, 
                'single' => false,
                'items' => []
            ], 
            // プリンター
            [
                'idx'    => 93, 
                'ttl' => 'プリンター',
                'img' => 'avpc/purinter.jpg', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'single' => false,
                'items' => []
            ], 
            // ＢＤレコーダー
            [
                'idx'    => 94, 
                'ttl' => 'ＢＤレコーダー',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 4, 
                'len_03' => 20, 
                'size'   => 3200, 
                'single' => false,
                'items' => []
            ],
            // スピーカー
            [
                'idx'    => 95, 
                'ttl' => 'スピーカー',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 70, 
                'size'   => 112000, 
                'single' => false,
                'items' => []
            ],
            // 据置ゲーム機
            [
                'idx'    => 96, 
                'ttl' => '据置ゲーム機',
                'img' => '', 
                'len_01' => 10, 
                'len_02' => 30, 
                'len_03' => 40, 
                'size'   => 12000, 
                'single' => false,
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '生活用品',
        'items' => [
            // 衣装ケース
            [
                'ttl' => '衣装ケース',
                'img' => 'seikatuyouhin/isyoucase.png', 
                'items' => [
                    [
                        'idx'    => 97, 
                        'ttl'    => '1段', 
                        'full_ttl'    => '衣装ケース [1段]', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 25, 
                        'size'   => 73125,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 98, 
                        'ttl'    => '2段', 
                        'full_ttl'    => '衣装ケース [2段]', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 50, 
                        'size'   => 146250,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 99, 
                        'ttl'    => '3段以上', 
                        'full_ttl'    => '衣装ケース [3段以上]', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 234000,
                        'single' => true,
                    ], 
                ]
            ],
            // カラーボックス
            [
                'ttl' => 'カラーボックス',
                'img' => 'seikatuyouhin/corolbox.png', 
                'items' => [
                    [
                        'idx'    => 100, 
                        'ttl'    => '1段', 
                        'full_ttl'    => 'カラーボックス [1段]', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 35, 
                        'size'   => 47250,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 101, 
                        'ttl'    => '2段', 
                        'full_ttl'    => 'カラーボックス [2段]', 
                        'len_01' => 45, 
                        'len_02' => 60, 
                        'len_03' => 35, 
                        'size'   => 94500,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 102, 
                        'ttl'    => '3段以上', 
                        'full_ttl'    => 'カラーボックス [3段以上]', 
                        'len_01' => 45, 
                        'len_02' => 90, 
                        'len_03' => 35, 
                        'size'   => 141750,
                        'single' => false,
                    ], 
                ]
            ],
            // パイプハンガー
            [
                'ttl' => 'パイプハンガー',
                'img' => 'seikatuyouhin/paipuhanger.png', 
                'items' => [
                    [
                        'idx'    => 103, 
                        'ttl'    => '小', 
                        'full_ttl'    => 'パイプハンガー [小]', 
                        'len_01' => 90, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 243000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 104, 
                        'ttl'    => '大', 
                        'full_ttl'    => 'パイプハンガー [大]', 
                        'len_01' => 120, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 324000,
                        'single' => false,
                    ], 
                ]
            ],
            // 布団一式
            [
                'idx'    => 105, 
                'ttl' => '布団一式',
                'img' => 'seikatuyouhin/huton.png', 
                'len_01' => 60, 
                'len_02' => 90, 
                'len_03' => 50, 
                'size'   => 270000, 
                'single' => true,
                'items' => []
            ], 
            // 物干し竿
            [
                'idx'    => 106, 
                'ttl' => '物干し竿',
                'img' => 'seikatuyouhin/monohosizao.png', 
                'len_01' => 20, 
                'len_02' => 20, 
                'len_03' => 150, 
                'size'   => 60000, 
                'single' => true,
                'items' => []
            ], 
            // スーツケース
            [
                'idx'    => 107, 
                'ttl' => 'スーツケース',
                'img' => 'seikatuyouhin/su-tucase.jpg', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'single' => false,
                'items' => []
            ], 
            // 2段脚立
            [
                'idx'    => 108, 
                'ttl' => '2段脚立',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 20, 
                'len_03' => 60, 
                'size'   => 48000, 
                'single' => false,
                'items' => []
            ], 
            // 金庫
            [
                'idx'    => 109, 
                'ttl' => '金庫',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 30, 
                'len_03' => 30, 
                'size'   => 36000, 
                'single' => false,
                'items' => []
            ], 
            // クッション
            [
                'idx'    => 110, 
                'ttl' => 'クッション',
                'img' => '', 
                'len_01' => 15, 
                'len_02' => 15, 
                'len_03' => 4, 
                'size'   => 900, 
                'single' => false,
                'items' => []
            ], 
            // ゴミ箱
            [
                'idx'    => 111, 
                'ttl' => 'ゴミ箱',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 30, 
                'len_03' => 40, 
                'size'   => 24000, 
                'single' => false,
                'items' => []
            ], 
            // 座椅子
            [
                'idx'    => 112, 
                'ttl' => '座椅子',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 64000, 
                'single' => false,
                'items' => []
            ], 
            // 座布団
            [
                'idx'    => 113, 
                'ttl' => '座布団',
                'img' => '', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 10, 
                'size'   => 36000, 
                'single' => false,
                'items' => []
            ], 
            // ズボンプレッサー
            [
                'idx'    => 114, 
                'ttl' => 'ズボンプレッサー',
                'img' => '', 
                'len_01' => 50, 
                'len_02' => 50, 
                'len_03' => 100, 
                'size'   => 250000, 
                'single' => false,
                'items' => []
            ], 
            // ポータブルトイレ
            [
                'idx'    => 115, 
                'ttl' => 'ポータブルトイレ',
                'img' => '', 
                'len_01' => 70, 
                'len_02' => 60, 
                'len_03' => 90, 
                'size'   => 378000, 
                'single' => false,
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => 'キッチン・水回り',
        'items' => [
            // ＩＨコンロ
            [
                'idx'    => 116, 
                'ttl' => 'ＩＨコンロ',
                'img' => '', 
                'len_01' => 75, 
                'len_02' => 55, 
                'len_03' => 10, 
                'size'   => 41250, 
                'single' => false,
                'items' => []
            ], 
            // 米びつ
            [
                'idx'    => 117, 
                'ttl' => '米びつ',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 40, 
                'len_03' => 70, 
                'size'   => 56000, 
                'single' => false,
                'items' => []
            ], 
            // 洗濯ラック
            [
                'idx'    => 118, 
                'ttl' => '洗濯ラック',
                'img' => '', 
                'len_01' => 100, 
                'len_02' => 50, 
                'len_03' => 180, 
                'size'   => 900000, 
                'single' => false,
                'items' => []
            ], 
            // トースター
            [
                'idx'    => 119, 
                'ttl' => 'トースター',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 20, 
                'size'   => 32000, 
                'single' => false,
                'items' => []
            ], 
            // 風呂用の椅子
            [
                'idx'    => 120, 
                'ttl' => '風呂用の椅子',
                'img' => '', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 48000, 
                'single' => false,
                'items' => []
            ], 
            // レンジ台
            [
                'ttl' => 'レンジ台',
                'img' => '', 
                'items' => [
                    [
                        'idx'    => 121, 
                        'ttl'    => 'レンジ台(小)', 
                        'full_ttl'    => 'レンジ台(小)', 
                        'len_01' => 50, 
                        'len_02' => 40, 
                        'len_03' => 140, 
                        'size'   => 280000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 122, 
                        'ttl'    => '大レンジ台(大)', 
                        'full_ttl'    => 'レンジ台(大)', 
                        'len_01' => 50, 
                        'len_02' => 40, 
                        'len_03' => 170, 
                        'size'   => 340000,
                        'single' => false,
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => '趣味',
        'items' => [
            // ギター
            [
                'idx'    => 123, 
                'ttl' => 'ギター',
                'img' => '', 
                'len_01' => 30, 
                'len_02' => 12, 
                'len_03' => 40, 
                'size'   => 14400, 
                'single' => false,
                'items' => []
            ], 
            // ゴルフバッグ
            [
                'idx'    => 124, 
                'ttl' => 'ゴルフバッグ',
                'img' => '', 
                'len_01' => 30, 
                'len_02' => 40, 
                'len_03' => 130, 
                'size'   => 156000, 
                'single' => false,
                'items' => []
            ], 
            // ベンチプレス
            [
                'idx'    => 125, 
                'ttl' => 'ゴルフバッグ',
                'img' => '', 
                'len_01' => 110, 
                'len_02' => 150, 
                'len_03' => 60, 
                'size'   => 990000, 
                'single' => false,
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => 'その他',
        'items' => [
            // 自転車
            [
                'ttl' => '自転車',
                'img' => '', 
                'items' => [
                    [
                        'idx'    => 126, 
                        'ttl'    => '大人用', 
                        'full_ttl'    => '自転車 [大人用]', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 880000,
                        'single' => true,
                    ], 
                    [
                        'idx'    => 127, 
                        'ttl'    => '子供用', 
                        'full_ttl'    => '自転車 [子供用]', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 90, 
                        'size'   => 450000,
                        'single' => false,
                    ], 
                    [
                        'idx'    => 128, 
                        'ttl'    => '折り畳み', 
                        'full_ttl'    => '自転車 [折り畳み]', 
                        'len_01' => 80, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 440000,
                        'single' => false,
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'ダンボール',
        'items' => [
            // ダンボール
            [
                'ttl' => 'ダンボール',
                'img' => '', 
                'items' => [
                    [
                        'idx'    => 129, 
                        'ttl'    => '大', 
                        'full_ttl'    => 'ダンボール [大]', 
                        'len_01' => 55, 
                        'len_02' => 40, 
                        'len_03' => 35, 
                        'size'   => 77000, 
                        'single' => true
                    ], 
                    [
                        'idx'    => 130, 
                        'ttl'    => '小', 
                        'full_ttl'    => 'ダンボール [小]', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 40, 
                        'size'   => 63000,
                        'single' => false
                    ], 
                ]
            ],
        ]
    ], 
];

$options = [
    [
        'ttl'   => '家　電　設　置', 
        'items' => [
            // テレビ設置
            [
                'idx'    => 0, 
                'ttl' => 'テレビ設置',
                'size'   => 2273, 
                'price'  => 2000,
                'items' => []
            ],
            // 録画機器設置
            [
                'idx'    => 1, 
                'ttl' => '録画機器設置',
                'size'   => 2273, 
                'price'  => 2000,
                'items' => []
            ],
            // 洗濯機設置
            [
                'ttl' => '洗濯機設置',
                'items' => [
                    [
                        'idx'    => 2, 
                        'ttl'    => '縦型', 
                        'full_ttl'    => '洗濯機設置 [縦型]', 
                        'size'   => 3500,
                        'price'  => 3500,
                    ],
                    [
                        'idx'    => 3, 
                        'ttl'    => 'ドラム式', 
                        'full_ttl'    => '洗濯機設置 [ドラム式]', 
                        'size'   => 5000,
                        'price'  => 5000,
                    ],
                    [
                        'idx'    => 4, 
                        'ttl'    => '二層式', 
                        'full_ttl'    => '洗濯機設置 [二層式]', 
                        'size'   => 3500,
                        'price'  => 3500,
                    ],
                ],
            ],
            // エアコン標準移設
            [
                'ttl' => 'エアコン標準移設',
                'items' => [
                    [
                        'idx'    => 5, 
                        'ttl'    => '～2.8KW', 
                        'full_ttl'    => 'エアコン標準移設 [～2.8KW]', 
                        'size'   => 15000,
                        'price'  => 15000,
                    ],
                    [
                        'idx'    => 6, 
                        'ttl'    => '3.6KW・4.0KW', 
                        'full_ttl'    => 'エアコン標準移設 [3.6KW・4.0KW]', 
                        'size'   => 17000,
                        'price'  => 17000,
                    ],
                    [
                        'idx'    => 7, 
                        'ttl'    => '5.6KW', 
                        'full_ttl'    => 'エアコン標準移設 [5.6KW]', 
                        'size'   => 19000,
                        'price'  => 19000,
                    ],
                    [
                        'idx'    => 8, 
                        'ttl'    => '6.3KW', 
                        'full_ttl'    => 'エアコン標準移設 [6.3KW]', 
                        'size'   => 21000,
                        'price'  => 21000,
                    ],
                ],
            ],
            // 照明取外・取付
            [
                'idx'    => 9, 
                'ttl' => '照明取外・取付',
                'size'   => 1000, 
                'price'  => 1000,
                'items' => []
            ],
            // 大型冷蔵庫運搬料
            [
                'idx'    => 10, 
                'ttl' => '大型冷蔵庫運搬料',
                'size'   => 4000, 
                'price'  => 4000,
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '家　具　設　置', 
        'items' => [
            // ベッド解体・組立
            [
                'ttl' => 'ベッド解体・組立',
                'items' => [
                    [
                        'idx'    => 11, 
                        'ttl'    => '引出なし', 
                        'full_ttl'    => 'ベッド解体・組立 [引出なし]', 
                        'size'   => 2500,
                        'price'  => 2500,
                    ],
                    [
                        'idx'    => 12, 
                        'ttl'    => '引出あり', 
                        'full_ttl'    => 'ベッド解体・組立 [引出あり]', 
                        'size'   => 3500,
                        'price'  => 3500,
                    ],
                    [
                        'idx'    => 13, 
                        'ttl'    => '2段', 
                        'full_ttl'    => 'ベッド解体・組立 [2段]', 
                        'size'   => 4500,
                        'price'  => 4500,
                    ],
                    [
                        'idx'    => 14, 
                        'ttl'    => '油圧式', 
                        'full_ttl'    => 'ベッド解体・組立 [油圧式]', 
                        'size'   => 7000,
                        'price'  => 7000,
                    ],
                ],
            ],
        ]
    ], 
    [
        'ttl'   => 'エアコンクリーニング', 
        'items' => [
            // 自動お掃除機能あり
            [
                'idx'    => 15, 
                'ttl' => '自動お掃除機能あり',
                'full_ttl'    => '自動お掃除機能あり [自動お掃除機能あり]', 
                'size'   => 18000,
                'price'  => 12000,
                'items' => []
            ],
            // 自動お掃除機能なし
            [
                'idx'    => 16, 
                'ttl' => '自動お掃除機能なし',
                'full_ttl'    => '自動お掃除機能あり [自動お掃除機能なし]', 
                'size'   => 12000,
                'price'  => 12000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => 'リサイクル処分', 
        'items' => [
        ]
    ], 
    [
        'ttl'   => 'マットレス処分', 
        'items' => [
            // シングル（スプリング入り）
            [
                'idx'    => 17, 
                'ttl' => 'シングル（スプリング入り）',
                'full_ttl'    => 'マットレス処分 [シングル（スプリング入り）]', 
                'size'   => 6000, 
                'price'  => 6000,
                'items' => []
            ],
            // セミダブル（スプリング入り）
            [
                'idx'    => 18, 
                'ttl' => 'セミダブル（スプリング入り）',
                'full_ttl'    => 'マットレス処分 [セミダブル（スプリング入り）]', 
                'size'   => 7000, 
                'price'  => 7000,
                'items' => []
            ],
            // ダブル（スプリング入り）
            [
                'idx'    => 19, 
                'ttl' => 'ダブル（スプリング入り）',
                'full_ttl'    => 'マットレス処分 [ダブル（スプリング入り）]', 
                'size'   => 8000,
                'price'  => 8000, 
                'items' => []
            ],
            // クイーン（スプリング入り）
            [
                'idx'    => 20, 
                'ttl' => 'クイーン（スプリング入り）',
                'full_ttl'    => 'マットレス処分 [クイーン（スプリング入り）]', 
                'size'   => 10000, 
                'price'  => 10000,
                'items' => []
            ],
            // 折り畳み 薄型S（スプリングなし）
            [
                'idx'    => 21, 
                'ttl' => '折り畳み 薄型S（スプリングなし）',
                'full_ttl'    => 'マットレス処分 [折り畳み 薄型S（スプリングなし）]', 
                'size'   => 1000, 
                'price'  => 1000,
                'items' => []
            ],
            // 折り畳み 薄型S（スプリングなし）
            [
                'idx'    => 22, 
                'ttl' => '折り畳み 薄型S（スプリングなし）',
                'full_ttl'    => 'マットレス処分 [折り畳み 薄型S（スプリングなし）]', 
                'size'   => 1000, 
                'price'  => 1000,
                'items' => []
            ],
            // 高・低反発S（スプリングなし）
            [
                'idx'    => 23, 
                'ttl' => '高・低反発S（スプリングなし）',
                'full_ttl'    => 'マットレス処分 [高・低反発S（スプリングなし）]', 
                'size'   => 3000, 
                'price'  => 3000,
                'items' => []
            ],
            // 高・低反発SW〜（スプリングなし）
            [
                'idx'    => 24, 
                'ttl' => '高・低反発SW〜（スプリングなし）',
                'full_ttl'    => 'マットレス処分 [高・低反発SW〜（スプリングなし）]', 
                'size'   => 4000, 
                'price'  => 4000,
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '不用品回収', 
        'items' => [
        ]
    ], 
    [
        'ttl'   => 'エリア外対応', 
        'items' => [
        ]
    ], 
    [
        'ttl'   => '4階以上作業', 
        'items' => [
        ]
    ], 
];

$price_goods = [
    [
        [ 20000, 30000, 30000 , 70000, 0, 0, 0 ], 
        [ 36000, 45455, 45455, 70000, 113636, 122727, 135000 ], 
        [ 40000, 50000, 50000, 74545, 118182, 127273, 140000 ], 
        [ 140000, 140000, 140000, 155000, 227273, 245455, 336364 ], 
    ], 
    [
        [ 30000, 40000, 45000, 70000, 0, 0, 0 ], 
        [ 45455, 45455, 55455, 70000, 113636, 122727, 144545 ], 
        [ 50000, 50000, 60000, 74545, 128182, 127273, 149091 ], 
        [ 140000, 140000, 140000, 155000, 227273, 245455, 336364 ], 
    ], 
    [
        [ 30000, 45000, 40000, 80000, 0, 0, 0 ], 
        [ 45455, 55455, 45455, 95455, 123636, 132727, 144545 ], 
        [ 50000, 60000, 50000, 100000, 128182, 136364, 149091 ], 
        [ 140000, 140000, 140000, 155000, 227273, 245455, 336364 ], 
    ], 
    [
        [ 70000, 70000, 70000, 100000, 0, 0, 0 ], 
        [ 70000, 70000, 95455, 145455, 168182, 122727, 254545 ], 
        [ 74545, 74545, 100000, 150000, 171818, 127273, 260000 ], 
        [ 155000, 155000, 155000, 155000, 0, 0, 0 ], 
    ], 
];

function get_area_idx($pref_id, $city_id) {
    $result = -1;
    if ($pref_id == 38) {
        if ($city_id == 1 || $city_id == 2 || $city_id == 3 || $city_id == 7 || $city_id == 14 || $city_id == 17) {
            $result = 0;
        } else if ($city_id == 0 || $city_id == 6 || $city_id == 11 || $city_id == 12 || $city_id == 15) {
            $result = 1;
        } else if ($city_id == 4 || $city_id == 5 || $city_id == 8 || $city_id == 9 || $city_id == 10 || $city_id == 13 || $city_id == 16 || $city_id == 18 || $city_id == 19) {
            $result = 2;
        }
    } else if ($pref_id == 37 || $pref_id == 36 || $pref_id == 39) {
        $result = 3;
    } else if ($pref_id == 34 || $pref_id == 33 || $pref_id == 35 || $pref_id == 31 || $pref_id == 32) {
        $result = 4;
    } else if ($pref_id == 27 || $pref_id == 26 || $pref_id == 28 || $pref_id == 25 || $pref_id == 29 || $pref_id == 30 || $pref_id == 24) {
        $result = 5;
    } else if ($pref_id == 40 || $pref_id == 41 || $pref_id == 42 || $pref_id == 43 || $pref_id == 44 || $pref_id == 45 || $pref_id == 46) {
        $result = 6;
    }
    return $result;
}
?>