<?php
$goods = [
    [
        'ttl'   => '家　電', 
        'items' => [
            [
                'ttl' => '冷蔵庫',
                'img' => 'kaden/reizouko-s.png', 
                'items' => [
                    [
                        'ttl'    => '100〜200L未満', 
                        'len_01' => 50, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 250000
                    ], 
                    [
                        'ttl'    => '200〜400L未満', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 160, 
                        'size'   => 576000
                    ], 
                    [
                        'ttl'    => '400〜500L未満', 
                        'len_01' => 60, 
                        'len_02' => 65, 
                        'len_03' => 180, 
                        'size'   => 702000
                    ], 
                    [
                        'ttl'    => '500L以上', 
                        'len_01' => 60, 
                        'len_02' => 75, 
                        'len_03' => 180, 
                        'size'   => 877500
                    ], 
                ]
            ],
            [
                'ttl' => '洗濯機',
                'img' => 'kaden/sentakuki.png', 
                'items' => [
                    [
                        'ttl'    => '4kg〜8kg', 
                        'len_01' => 55, 
                        'len_02' => 55, 
                        'len_03' => 85, 
                        'size'   => 257125
                    ], 
                    [
                        'ttl'    => '9kg以上', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 90, 
                        'size'   => 324000
                    ], 
                    [
                        'ttl'    => 'ドラム式', 
                        'len_01' => 60, 
                        'len_02' => 70, 
                        'len_03' => 110, 
                        'size'   => 462000
                    ], 
                ]
            ],
            [
                'ttl' => 'レンジ',
                'img' => 'kaden/renji.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ],
            [
                'ttl' => 'エアコン',
                'img' => 'kaden/eakon.png', 
                'items' => [
                    [
                        'ttl'    => '一般', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 90, 
                        'size'   => 216000
                    ], 
                    [
                        'ttl'    => '窓用', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 100, 
                        'size'   => 240000
                    ], 
                ]
            ],
            [
                'ttl' => 'ファンヒーター',
                'img' => 'kaden/pensutando.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ],
            [
                'ttl' => 'こたつ',
                'img' => 'kaden/kotatu.png', 
                'items' => [
                    [
                        'ttl'    => '正方形', 
                        'len_01' => 75, 
                        'len_02' => 75, 
                        'len_03' => 40, 
                        'size'   => 225000
                    ], 
                    [
                        'ttl'    => '長方形', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 40, 
                        'size'   => 240000
                    ], 
                ]
            ],
            [
                'ttl' => '空気清浄機',
                'img' => 'kaden/kuukiseijyouki.png', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'items' => []
            ],
            [
                'ttl' => 'ウォーターサーバー',
                'img' => 'kaden/woterserver.png', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 150, 
                'size'   => 240000, 
                'items' => []
            ],
            [
                'ttl' => '掃除機',
                'img' => 'kaden/soujiki.png', 
                'len_01' => 30, 
                'len_02' => 30, 
                'len_03' => 90, 
                'size'   => 81000, 
                'items' => []
            ],
            [
                'ttl' => '扇風機',
                'img' => 'kaden/senpuuki.png', 
                'len_01' => 40, 
                'len_02' => 30, 
                'len_03' => 70, 
                'size'   => 84000, 
                'items' => []
            ],
            [
                'ttl' => 'ガスコンロ',
                'img' => 'kaden/konro.png', 
                'len_01' => 55, 
                'len_02' => 40, 
                'len_03' => 25, 
                'size'   => 55000, 
                'items' => []
            ],
            [
                'ttl' => 'オーブントースター',
                'img' => '', 
                'len_01' => 35, 
                'len_02' => 25, 
                'len_03' => 30, 
                'size'   => 26250, 
                'items' => []
            ],
            [
                'ttl' => '炊飯器',
                'img' => '', 
                'len_01' => 25, 
                'len_02' => 35, 
                'len_03' => 20, 
                'size'   => 17500, 
                'items' => []
            ],
            [
                'ttl' => 'ポット',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 30, 
                'len_03' => 25, 
                'size'   => 15000, 
                'items' => []
            ],
            [
                'ttl' => '照明器具',
                'img' => 'kaden/siiringulight.png', 
                'len_01' => 50, 
                'len_02' => 50, 
                'len_03' => 30, 
                'size'   => 75000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '家　具',
        'items' => [
            // 洋タンス（ワードロ－プ）
            [
                'ttl' => '洋タンス（ワードロ－プ）',
                'img' => 'kagu/youdansu.png', 
                'items' => [
                    [
                        'ttl'    => '扉2枚タイプ', 
                        'len_01' => 100, 
                        'len_02' => 70, 
                        'len_03' => 210, 
                        'size'   => 1470000
                    ], 
                    [
                        'ttl'    => '扉3枚タイプ', 
                        'len_01' => 140, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 1764000
                    ], 
                    [
                        'ttl'    => '扉4枚タイプ', 
                        'len_01' => 160, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 2016000
                    ], 
                ]
            ],
            // 和ダンス            
            [
                'ttl' => '和ダンス・5段引き出し',
                'img' => 'kagu/wadansu.jpg', 
                'items' => [
                    [
                        'ttl'    => 'W100', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 500000
                    ], 
                    [
                        'ttl'    => 'W120', 
                        'len_01' => 120, 
                        'len_02' => 60, 
                        'len_03' => 130, 
                        'size'   => 936000
                    ], 
                ]
            ],
            // 整理ダンス
            [
                'ttl' => '整理ダンス',
                'img' => 'kagu/seiridansu.png', 
                'items' => [
                    [
                        'ttl'    => '引出3段以下', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 60, 
                        'size'   => 396000
                    ], 
                    [
                        'ttl'    => '引出5段以下', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 110, 
                        'size'   => 726000
                    ], 
                    [
                        'ttl'    => '引出6段以上', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 150, 
                        'size'   => 990000
                    ], 
                ]
            ],
            // ベッド
            [
                'ttl' => 'ベッド',
                'img' => 'kagu/bed.png', 
                'items' => [
                    [
                        'ttl'    => 'シングル', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1260000
                    ], 
                    [
                        'ttl'    => 'セミダブル', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1312500
                    ], 
                    [
                        'ttl'    => 'ダブル', 
                        'len_01' => 165, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1732500
                    ], 
                    [
                        'ttl'    => 'クイーン', 
                        'len_01' => 180, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1890000
                    ], 
                    [
                        'ttl'    => 'ダブル二つ折り', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 687500
                    ], 
                ]
            ],
            // マットレス
            [
                'ttl' => 'マットレス',
                'img' => 'kagu/mattoresu.jpg', 
                'items' => [
                    [
                        'ttl'    => 'シングル', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1000000
                    ], 
                    [
                        'ttl'    => 'セミダブル', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1200000
                    ], 
                    [
                        'ttl'    => 'ダブル', 
                        'len_01' => 140, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1400000
                    ], 
                    [
                        'ttl'    => 'クイーン', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1600000
                    ], 
                    [
                        'ttl'    => '折り畳み', 
                        'len_01' => 100, 
                        'len_02' => 60, 
                        'len_03' => 70, 
                        'size'   => 420000
                    ], 
                ]
            ],
            // メタルラック（分解可）
            [
                'ttl' => 'メタルラック（分解可）',
                'img' => 'kagu/', 
                'items' => [
                    [
                        'ttl'    => '横幅60以下', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 648000
                    ], 
                    [
                        'ttl'    => '横幅90以下', 
                        'len_01' => 90, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 972000
                    ], 
                    [
                        'ttl'    => '横幅120以上', 
                        'len_01' => 180, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 1944000
                    ], 
                ]
            ],
            // ローボード
            [
                'ttl' => 'ローボード',
                'img' => 'kagu/ro-bord.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 50, 
                'size'   => 225000, 
                'items' => []
            ],
            // 姿見
            [
                'ttl' => '姿見',
                'img' => 'kagu/sugatami.png', 
                'len_01' => 30, 
                'len_02' => 190, 
                'len_03' => 20, 
                'size'   => 114000, 
                'items' => []
            ],
            // ドレッサー
            [
                'ttl' => 'ドレッサー',
                'img' => 'kagu/doressa-.png', 
                'items' => [
                    [
                        'ttl'    => '横幅60以下', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 216000
                    ], 
                    [
                        'ttl'    => '横幅90以下', 
                        'len_01' => 90, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 324000
                    ], 
                    [
                        'ttl'    => '横幅91以上', 
                        'len_01' => 120, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 432000
                    ], 
                ]
            ],
            // 本棚
            [
                'ttl' => '本棚',
                'img' => 'kagu/hondana.png', 
                'items' => [
                    [
                        'ttl'    => '100cm以下', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 350000
                    ], 
                    [
                        'ttl'    => '150cm以下', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 150, 
                        'size'   => 525000
                    ], 
                    [
                        'ttl'    => '180cm以下', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 180, 
                        'size'   => 630000
                    ], 
                ]
            ],
            // カーペット（6畳まで）
            [
                'ttl' => 'カーペット（6畳まで）',
                'img' => 'kagu/karpet.png', 
                'len_01' => 360, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 576000, 
                'items' => []
            ],
            // 学習机
            [
                'ttl' => '学習机',
                'img' => 'kagu/gakusyudukue.jpg', 
                'items' => [
                    [
                        'ttl'    => '本体のみ', 
                        'len_01' => 110, 
                        'len_02' => 75, 
                        'len_03' => 75, 
                        'size'   => 618750
                    ], 
                    [
                        'ttl'    => '脇棚', 
                        'len_01' => 50, 
                        'len_02' => 70, 
                        'len_03' => 75, 
                        'size'   => 262500
                    ], 
                ]
            ],
            // 机用椅子
            [
                'ttl' => '机用椅子',
                'img' => 'kagu/tukueyouisu.jpg', 
                'len_01' => 40, 
                'len_02' => 60, 
                'len_03' => 95, 
                'size'   => 228000, 
                'items' => []
            ],
            // ソファー
            [
                'ttl' => 'ソファー',
                'img' => 'kagu/sofa.png', 
                'items' => [
                    [
                        'ttl'    => '1人掛け', 
                        'len_01' => 80, 
                        'len_02' => 90, 
                        'len_03' => 50, 
                        'size'   => 648000
                    ], 
                    [
                        'ttl'    => '2人掛け', 
                        'len_01' => 150, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1080000
                    ], 
                    [
                        'ttl'    => '3人掛け', 
                        'len_01' => 240, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1728000
                    ], 
                    [
                        'ttl'    => 'L字型', 
                        'len_01' => 390, 
                        'len_02' => 160, 
                        'len_03' => 180, 
                        'size'   => 11232000
                    ], 
                    [
                        'ttl'    => 'オットマン', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 40, 
                        'size'   => 256000
                    ], 
                ]
            ],
            // リビングテーブル
            [
                'ttl' => 'リビングテーブル',
                'img' => 'kagu/ribingute-buru.png', 
                'items' => [
                    [
                        'ttl'    => '横幅100cmまで', 
                        'len_01' => 100, 
                        'len_02' => 75, 
                        'len_03' => 55, 
                        'size'   => 412500
                    ], 
                    [
                        'ttl'    => '横幅100cm以上', 
                        'len_01' => 160, 
                        'len_02' => 70, 
                        'len_03' => 55, 
                        'size'   => 616000
                    ], 
                ]
            ],
            // 食器棚（分解可能）
            [
                'ttl' => '食器棚（分解可能）',
                'img' => 'kagu/syokkidana.png', 
                'items' => [
                    [
                        'ttl'    => '横幅90cm以下', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 832500
                    ], 
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1110000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1387500
                    ], 
                ]
            ],
            // 食器棚（分解不可）
            [
                'ttl' => '食器棚（分解不可）',
                'img' => 'kagu/syokkidana2.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 190, 
                'size'   => 855000, 
                'items' => []
            ],
            // 食卓テーブル
            [
                'ttl' => '食卓テーブル',
                'img' => 'kagu/syokutakute-buru.png', 
                'items' => [
                    [
                        'ttl'    => '横幅90cm以下', 
                        'len_01' => 90, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 792000
                    ], 
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1056000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 160, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1408000
                    ], 
                ]
            ],
            // 椅子
            [
                'ttl' => '椅子',
                'img' => 'kagu/isu.png', 
                'len_01' => 40, 
                'len_02' => 50, 
                'len_03' => 90, 
                'size'   => 180000, 
                'items' => []
            ], 
            // ローテーブル
            [
                'ttl' => 'ローテーブル',
                'img' => 'kagu/ro-te-buru.jpg', 
                'items' => [
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 375000
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'AV・PC',
        'items' => [
            // ブラウン管テレビ
            [
                'ttl' => 'ブラウン管テレビ',
                'img' => 'avpc/buraunkan.jpg', 
                'items' => [
                    [
                        'ttl'    => '21未満', 
                        'len_01' => 50, 
                        'len_02' => 60, 
                        'len_03' => 50, 
                        'size'   => 150000
                    ], 
                    [
                        'ttl'    => '21以上50未満', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 80, 
                        'size'   => 512000
                    ], 
                    [
                        'ttl'    => '50以上', 
                        'len_01' => 100, 
                        'len_02' => 100, 
                        'len_03' => 100, 
                        'size'   => 1000000
                    ], 
                ]
            ],
            // 液晶テレビ
            [
                'ttl' => '液晶テレビ',
                'img' => 'avpc/tv.png', 
                'items' => [
                    [
                        'ttl'    => '32未満', 
                        'len_01' => 70, 
                        'len_02' => 40, 
                        'len_03' => 40, 
                        'size'   => 112000
                    ], 
                    [
                        'ttl'    => '32以上50未満', 
                        'len_01' => 110, 
                        'len_02' => 40, 
                        'len_03' => 60, 
                        'size'   => 264000
                    ], 
                    [
                        'ttl'    => '50以上', 
                        'len_01' => 150, 
                        'len_02' => 60, 
                        'len_03' => 80, 
                        'size'   => 720000
                    ], 
                ]
            ], 
            // テレビ台（ロータイプ）
            [
                'ttl' => 'テレビ台（ロータイプ）',
                'img' => 'avpc/tv-dai.png', 
                'items' => [
                    [
                        'ttl'    => '横幅90cm以下', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 225000
                    ], 
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 400000
                    ], 
                ]
            ], 
            // テレビ台（特大）
            [
                'ttl' => 'テレビ台（特大）',
                'img' => 'avpc/tv-dai-tokudai.jpg', 
                'len_01' => 180, 
                'len_02' => 60, 
                'len_03' => 180, 
                'size'   => 1944000, 
                'items' => []
            ], 
            // デスクトップパソコン
            [
                'ttl' => 'デスクトップパソコン',
                'img' => 'avpc/pc.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 80000, 
                'items' => []
            ], 
            // パソコンラック
            [
                'ttl' => 'パソコンラック',
                'img' => 'avpc/pc-rack.png', 
                'len_01' => 60, 
                'len_02' => 50, 
                'len_03' => 110, 
                'size'   => 330000, 
                'items' => []
            ], 
            // プリンター
            [
                'ttl' => 'プリンター',
                'img' => 'avpc/purinter.jpg', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => '生活用品',
        'items' => [
            // 衣装ケース
            [
                'ttl' => '衣装ケース',
                'img' => 'seikatuyouhin/isyoucase.png', 
                'items' => [
                    [
                        'ttl'    => '1段', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 25, 
                        'size'   => 73125
                    ], 
                    [
                        'ttl'    => '2段', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 50, 
                        'size'   => 146250
                    ], 
                    [
                        'ttl'    => '3段以上', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 234000
                    ], 
                ]
            ],
            // カラーボックス
            [
                'ttl' => 'カラーボックス',
                'img' => 'seikatuyouhin/corolbox.png', 
                'items' => [
                    [
                        'ttl'    => '1段', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 35, 
                        'size'   => 47250
                    ], 
                    [
                        'ttl'    => '2段', 
                        'len_01' => 45, 
                        'len_02' => 60, 
                        'len_03' => 35, 
                        'size'   => 94500
                    ], 
                    [
                        'ttl'    => '3段以上', 
                        'len_01' => 45, 
                        'len_02' => 90, 
                        'len_03' => 35, 
                        'size'   => 141750
                    ], 
                ]
            ],
            // パイプハンガー
            [
                'ttl' => 'パイプハンガー',
                'img' => 'seikatuyouhin/paipuhanger.png', 
                'items' => [
                    [
                        'ttl'    => '小', 
                        'len_01' => 90, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 243000
                    ], 
                    [
                        'ttl'    => '大', 
                        'len_01' => 120, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 324000
                    ], 
                ]
            ],
            // 布団一式
            [
                'ttl' => '布団一式',
                'img' => 'seikatuyouhin/huton.png', 
                'len_01' => 60, 
                'len_02' => 90, 
                'len_03' => 50, 
                'size'   => 270000, 
                'items' => []
            ], 
            // 物干し竿
            [
                'ttl' => '物干し竿',
                'img' => 'seikatuyouhin/monohosizao.png', 
                'len_01' => 20, 
                'len_02' => 20, 
                'len_03' => 150, 
                'size'   => 60000, 
                'items' => []
            ], 
            // スーツケース
            [
                'ttl' => 'スーツケース',
                'img' => 'seikatuyouhin/su-tucase.jpg', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => 'その他',
        'items' => [
            // 自転車
            [
                'ttl' => '自転車',
                'img' => '', 
                'items' => [
                    [
                        'ttl'    => '大人用', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 880000
                    ], 
                    [
                        'ttl'    => '子供用', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 90, 
                        'size'   => 450000
                    ], 
                    [
                        'ttl'    => '折り畳み', 
                        'len_01' => 80, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 440000
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'ダンボール',
        'items' => [
            // ダンボール
            [
                'ttl' => 'ダンボール',
                'img' => '', 
                'items' => [
                    [
                        'ttl'    => '大', 
                        'len_01' => 55, 
                        'len_02' => 40, 
                        'len_03' => 35, 
                        'size'   => 77000
                    ], 
                    [
                        'ttl'    => '小', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 40, 
                        'size'   => 63000
                    ], 
                ]
            ],
        ]
    ], 
];

$options = [
    [
        'ttl'   => '家　電', 
        'items' => [
            [
                'ttl' => '冷蔵庫',
                'img' => 'kaden/reizouko-s.png', 
                'items' => [
                    [
                        'ttl'    => '100〜200L未満', 
                        'len_01' => 50, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 250000
                    ], 
                    [
                        'ttl'    => '200〜400L未満', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 160, 
                        'size'   => 576000
                    ], 
                    [
                        'ttl'    => '400〜500L未満', 
                        'len_01' => 60, 
                        'len_02' => 65, 
                        'len_03' => 180, 
                        'size'   => 702000
                    ], 
                    [
                        'ttl'    => '500L以上', 
                        'len_01' => 60, 
                        'len_02' => 75, 
                        'len_03' => 180, 
                        'size'   => 877500
                    ], 
                ]
            ],
            [
                'ttl' => '洗濯機',
                'img' => 'kaden/sentakuki.png', 
                'items' => [
                    [
                        'ttl'    => '4kg〜8kg', 
                        'len_01' => 55, 
                        'len_02' => 55, 
                        'len_03' => 85, 
                        'size'   => 257125
                    ], 
                    [
                        'ttl'    => '9kg以上', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 90, 
                        'size'   => 324000
                    ], 
                    [
                        'ttl'    => 'ドラム式', 
                        'len_01' => 60, 
                        'len_02' => 70, 
                        'len_03' => 110, 
                        'size'   => 462000
                    ], 
                ]
            ],
            [
                'ttl' => 'レンジ',
                'img' => 'kaden/renji.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ],
            [
                'ttl' => 'エアコン',
                'img' => 'kaden/eakon.png', 
                'items' => [
                    [
                        'ttl'    => '一般', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 90, 
                        'size'   => 216000
                    ], 
                    [
                        'ttl'    => '窓用', 
                        'len_01' => 80, 
                        'len_02' => 30, 
                        'len_03' => 100, 
                        'size'   => 240000
                    ], 
                ]
            ],
            [
                'ttl' => 'ファンヒーター',
                'img' => 'kaden/pensutando.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ],
            [
                'ttl' => 'こたつ',
                'img' => 'kaden/kotatu.png', 
                'items' => [
                    [
                        'ttl'    => '正方形', 
                        'len_01' => 75, 
                        'len_02' => 75, 
                        'len_03' => 40, 
                        'size'   => 225000
                    ], 
                    [
                        'ttl'    => '長方形', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 40, 
                        'size'   => 240000
                    ], 
                ]
            ],
            [
                'ttl' => '空気清浄機',
                'img' => 'kaden/kuukiseijyouki.png', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'items' => []
            ],
            [
                'ttl' => 'ウォーターサーバー',
                'img' => 'kaden/woterserver.png', 
                'len_01' => 40, 
                'len_02' => 40, 
                'len_03' => 150, 
                'size'   => 240000, 
                'items' => []
            ],
            [
                'ttl' => '掃除機',
                'img' => 'kaden/soujiki.png', 
                'len_01' => 30, 
                'len_02' => 30, 
                'len_03' => 90, 
                'size'   => 81000, 
                'items' => []
            ],
            [
                'ttl' => '扇風機',
                'img' => 'kaden/senpuuki.png', 
                'len_01' => 40, 
                'len_02' => 30, 
                'len_03' => 70, 
                'size'   => 84000, 
                'items' => []
            ],
            [
                'ttl' => 'ガスコンロ',
                'img' => 'kaden/konro.png', 
                'len_01' => 55, 
                'len_02' => 40, 
                'len_03' => 25, 
                'size'   => 55000, 
                'items' => []
            ],
            [
                'ttl' => 'オーブントースター',
                'img' => '', 
                'len_01' => 35, 
                'len_02' => 25, 
                'len_03' => 30, 
                'size'   => 26250, 
                'items' => []
            ],
            [
                'ttl' => '炊飯器',
                'img' => '', 
                'len_01' => 25, 
                'len_02' => 35, 
                'len_03' => 20, 
                'size'   => 17500, 
                'items' => []
            ],
            [
                'ttl' => 'ポット',
                'img' => '', 
                'len_01' => 20, 
                'len_02' => 30, 
                'len_03' => 25, 
                'size'   => 15000, 
                'items' => []
            ],
            [
                'ttl' => '照明器具',
                'img' => 'kaden/siiringulight.png', 
                'len_01' => 50, 
                'len_02' => 50, 
                'len_03' => 30, 
                'size'   => 75000, 
                'items' => []
            ],
        ]
    ], 
    [
        'ttl'   => '家　具',
        'items' => [
            // 洋タンス（ワードロ－プ）
            [
                'ttl' => '洋タンス（ワードロ－プ）',
                'img' => 'kagu/youdansu.png', 
                'items' => [
                    [
                        'ttl'    => '扉2枚タイプ', 
                        'len_01' => 100, 
                        'len_02' => 70, 
                        'len_03' => 210, 
                        'size'   => 1470000
                    ], 
                    [
                        'ttl'    => '扉3枚タイプ', 
                        'len_01' => 140, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 1764000
                    ], 
                    [
                        'ttl'    => '扉4枚タイプ', 
                        'len_01' => 160, 
                        'len_02' => 60, 
                        'len_03' => 210, 
                        'size'   => 2016000
                    ], 
                ]
            ],
            // 和ダンス            
            [
                'ttl' => '和ダンス・5段引き出し',
                'img' => 'kagu/wadansu.jpg', 
                'items' => [
                    [
                        'ttl'    => 'W100', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 500000
                    ], 
                    [
                        'ttl'    => 'W120', 
                        'len_01' => 120, 
                        'len_02' => 60, 
                        'len_03' => 130, 
                        'size'   => 936000
                    ], 
                ]
            ],
            // 整理ダンス
            [
                'ttl' => '整理ダンス',
                'img' => 'kagu/seiridansu.png', 
                'items' => [
                    [
                        'ttl'    => '引出3段以下', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 60, 
                        'size'   => 396000
                    ], 
                    [
                        'ttl'    => '引出5段以下', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 110, 
                        'size'   => 726000
                    ], 
                    [
                        'ttl'    => '引出6段以上', 
                        'len_01' => 110, 
                        'len_02' => 60, 
                        'len_03' => 150, 
                        'size'   => 990000
                    ], 
                ]
            ],
            // ベッド
            [
                'ttl' => 'ベッド',
                'img' => 'kagu/bed.png', 
                'items' => [
                    [
                        'ttl'    => 'シングル', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1260000
                    ], 
                    [
                        'ttl'    => 'セミダブル', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1312500
                    ], 
                    [
                        'ttl'    => 'ダブル', 
                        'len_01' => 165, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1732500
                    ], 
                    [
                        'ttl'    => 'クイーン', 
                        'len_01' => 180, 
                        'len_02' => 50, 
                        'len_03' => 210, 
                        'size'   => 1890000
                    ], 
                    [
                        'ttl'    => 'ダブル二つ折り', 
                        'len_01' => 125, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 687500
                    ], 
                ]
            ],
            // マットレス
            [
                'ttl' => 'マットレス',
                'img' => 'kagu/mattoresu.jpg', 
                'items' => [
                    [
                        'ttl'    => 'シングル', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1000000
                    ], 
                    [
                        'ttl'    => 'セミダブル', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1200000
                    ], 
                    [
                        'ttl'    => 'ダブル', 
                        'len_01' => 140, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1400000
                    ], 
                    [
                        'ttl'    => 'クイーン', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 200, 
                        'size'   => 1600000
                    ], 
                    [
                        'ttl'    => '折り畳み', 
                        'len_01' => 100, 
                        'len_02' => 60, 
                        'len_03' => 70, 
                        'size'   => 420000
                    ], 
                ]
            ],
            // メタルラック（分解可）
            [
                'ttl' => 'メタルラック（分解可）',
                'img' => 'kagu/', 
                'items' => [
                    [
                        'ttl'    => '横幅60以下', 
                        'len_01' => 60, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 648000
                    ], 
                    [
                        'ttl'    => '横幅90以下', 
                        'len_01' => 90, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 972000
                    ], 
                    [
                        'ttl'    => '横幅120以上', 
                        'len_01' => 180, 
                        'len_02' => 60, 
                        'len_03' => 180, 
                        'size'   => 1944000
                    ], 
                ]
            ],
            // ローボード
            [
                'ttl' => 'ローボード',
                'img' => 'kagu/ro-bord.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 50, 
                'size'   => 225000, 
                'items' => []
            ],
            // 姿見
            [
                'ttl' => '姿見',
                'img' => 'kagu/sugatami.png', 
                'len_01' => 30, 
                'len_02' => 190, 
                'len_03' => 20, 
                'size'   => 114000, 
                'items' => []
            ],
            // ドレッサー
            [
                'ttl' => 'ドレッサー',
                'img' => 'kagu/doressa-.png', 
                'items' => [
                    [
                        'ttl'    => '横幅60以下', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 216000
                    ], 
                    [
                        'ttl'    => '横幅90以下', 
                        'len_01' => 90, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 324000
                    ], 
                    [
                        'ttl'    => '横幅91以上', 
                        'len_01' => 120, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 432000
                    ], 
                ]
            ],
            // 本棚
            [
                'ttl' => '本棚',
                'img' => 'kagu/hondana.png', 
                'items' => [
                    [
                        'ttl'    => '100cm以下', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 100, 
                        'size'   => 350000
                    ], 
                    [
                        'ttl'    => '150cm以下', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 150, 
                        'size'   => 525000
                    ], 
                    [
                        'ttl'    => '180cm以下', 
                        'len_01' => 70, 
                        'len_02' => 50, 
                        'len_03' => 180, 
                        'size'   => 630000
                    ], 
                ]
            ],
            // カーペット（6畳まで）
            [
                'ttl' => 'カーペット（6畳まで）',
                'img' => 'kagu/karpet.png', 
                'len_01' => 360, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 576000, 
                'items' => []
            ],
            // 学習机
            [
                'ttl' => '学習机',
                'img' => 'kagu/gakusyudukue.jpg', 
                'items' => [
                    [
                        'ttl'    => '本体のみ', 
                        'len_01' => 110, 
                        'len_02' => 75, 
                        'len_03' => 75, 
                        'size'   => 618750
                    ], 
                    [
                        'ttl'    => '脇棚', 
                        'len_01' => 50, 
                        'len_02' => 70, 
                        'len_03' => 75, 
                        'size'   => 262500
                    ], 
                ]
            ],
            // 机用椅子
            [
                'ttl' => '机用椅子',
                'img' => 'kagu/tukueyouisu.jpg', 
                'len_01' => 40, 
                'len_02' => 60, 
                'len_03' => 95, 
                'size'   => 228000, 
                'items' => []
            ],
            // ソファー
            [
                'ttl' => 'ソファー',
                'img' => 'kagu/sofa.png', 
                'items' => [
                    [
                        'ttl'    => '1人掛け', 
                        'len_01' => 80, 
                        'len_02' => 90, 
                        'len_03' => 50, 
                        'size'   => 648000
                    ], 
                    [
                        'ttl'    => '2人掛け', 
                        'len_01' => 150, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1080000
                    ], 
                    [
                        'ttl'    => '3人掛け', 
                        'len_01' => 240, 
                        'len_02' => 80, 
                        'len_03' => 90, 
                        'size'   => 1728000
                    ], 
                    [
                        'ttl'    => 'L字型', 
                        'len_01' => 390, 
                        'len_02' => 160, 
                        'len_03' => 180, 
                        'size'   => 11232000
                    ], 
                    [
                        'ttl'    => 'オットマン', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 40, 
                        'size'   => 256000
                    ], 
                ]
            ],
            // リビングテーブル
            [
                'ttl' => 'リビングテーブル',
                'img' => 'kagu/ribingute-buru.png', 
                'items' => [
                    [
                        'ttl'    => '横幅100cmまで', 
                        'len_01' => 100, 
                        'len_02' => 75, 
                        'len_03' => 55, 
                        'size'   => 412500
                    ], 
                    [
                        'ttl'    => '横幅100cm以上', 
                        'len_01' => 160, 
                        'len_02' => 70, 
                        'len_03' => 55, 
                        'size'   => 616000
                    ], 
                ]
            ],
            // 食器棚（分解可能）
            [
                'ttl' => '食器棚（分解可能）',
                'img' => 'kagu/syokkidana.png', 
                'items' => [
                    [
                        'ttl'    => '横幅90cm以下', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 832500
                    ], 
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1110000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 185, 
                        'size'   => 1387500
                    ], 
                ]
            ],
            // 食器棚（分解不可）
            [
                'ttl' => '食器棚（分解不可）',
                'img' => 'kagu/syokkidana2.png', 
                'len_01' => 90, 
                'len_02' => 50, 
                'len_03' => 190, 
                'size'   => 855000, 
                'items' => []
            ],
            // 食卓テーブル
            [
                'ttl' => '食卓テーブル',
                'img' => 'kagu/syokutakute-buru.png', 
                'items' => [
                    [
                        'ttl'    => '横幅90cm以下', 
                        'len_01' => 90, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 792000
                    ], 
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1056000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 160, 
                        'len_02' => 80, 
                        'len_03' => 110, 
                        'size'   => 1408000
                    ], 
                ]
            ],
            // 椅子
            [
                'ttl' => '椅子',
                'img' => 'kagu/isu.png', 
                'len_01' => 40, 
                'len_02' => 50, 
                'len_03' => 90, 
                'size'   => 180000, 
                'items' => []
            ], 
            // ローテーブル
            [
                'ttl' => 'ローテーブル',
                'img' => 'kagu/ro-te-buru.jpg', 
                'items' => [
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 150, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 375000
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'AV・PC',
        'items' => [
            // ブラウン管テレビ
            [
                'ttl' => 'ブラウン管テレビ',
                'img' => 'avpc/buraunkan.jpg', 
                'items' => [
                    [
                        'ttl'    => '21未満', 
                        'len_01' => 50, 
                        'len_02' => 60, 
                        'len_03' => 50, 
                        'size'   => 150000
                    ], 
                    [
                        'ttl'    => '21以上50未満', 
                        'len_01' => 80, 
                        'len_02' => 80, 
                        'len_03' => 80, 
                        'size'   => 512000
                    ], 
                    [
                        'ttl'    => '50以上', 
                        'len_01' => 100, 
                        'len_02' => 100, 
                        'len_03' => 100, 
                        'size'   => 1000000
                    ], 
                ]
            ],
            // 液晶テレビ
            [
                'ttl' => '液晶テレビ',
                'img' => 'avpc/tv.png', 
                'items' => [
                    [
                        'ttl'    => '32未満', 
                        'len_01' => 70, 
                        'len_02' => 40, 
                        'len_03' => 40, 
                        'size'   => 112000
                    ], 
                    [
                        'ttl'    => '32以上50未満', 
                        'len_01' => 110, 
                        'len_02' => 40, 
                        'len_03' => 60, 
                        'size'   => 264000
                    ], 
                    [
                        'ttl'    => '50以上', 
                        'len_01' => 150, 
                        'len_02' => 60, 
                        'len_03' => 80, 
                        'size'   => 720000
                    ], 
                ]
            ], 
            // テレビ台（ロータイプ）
            [
                'ttl' => 'テレビ台（ロータイプ）',
                'img' => 'avpc/tv-dai.png', 
                'items' => [
                    [
                        'ttl'    => '横幅90cm以下', 
                        'len_01' => 90, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 225000
                    ], 
                    [
                        'ttl'    => '横幅120cm以下', 
                        'len_01' => 120, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 300000
                    ], 
                    [
                        'ttl'    => '横幅121cm以上', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 50, 
                        'size'   => 400000
                    ], 
                ]
            ], 
            // テレビ台（特大）
            [
                'ttl' => 'テレビ台（特大）',
                'img' => 'avpc/tv-dai-tokudai.jpg', 
                'len_01' => 180, 
                'len_02' => 60, 
                'len_03' => 180, 
                'size'   => 1944000, 
                'items' => []
            ], 
            // デスクトップパソコン
            [
                'ttl' => 'デスクトップパソコン',
                'img' => 'avpc/pc.png', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 40, 
                'size'   => 80000, 
                'items' => []
            ], 
            // パソコンラック
            [
                'ttl' => 'パソコンラック',
                'img' => 'avpc/pc-rack.png', 
                'len_01' => 60, 
                'len_02' => 50, 
                'len_03' => 110, 
                'size'   => 330000, 
                'items' => []
            ], 
            // プリンター
            [
                'ttl' => 'プリンター',
                'img' => 'avpc/purinter.jpg', 
                'len_01' => 50, 
                'len_02' => 40, 
                'len_03' => 30, 
                'size'   => 60000, 
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => '生活用品',
        'items' => [
            // 衣装ケース
            [
                'ttl' => '衣装ケース',
                'img' => 'seikatuyouhin/isyoucase.png', 
                'items' => [
                    [
                        'ttl'    => '1段', 
                        'len_01' => 60, 
                        'len_02' => 45, 
                        'len_03' => 25, 
                        'size'   => 73125
                    ], 
                    [
                        'ttl'    => '2段', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 50, 
                        'size'   => 146250
                    ], 
                    [
                        'ttl'    => '3段以上', 
                        'len_01' => 65, 
                        'len_02' => 45, 
                        'len_03' => 80, 
                        'size'   => 234000
                    ], 
                ]
            ],
            // カラーボックス
            [
                'ttl' => 'カラーボックス',
                'img' => 'seikatuyouhin/corolbox.png', 
                'items' => [
                    [
                        'ttl'    => '1段', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 35, 
                        'size'   => 47250
                    ], 
                    [
                        'ttl'    => '2段', 
                        'len_01' => 45, 
                        'len_02' => 60, 
                        'len_03' => 35, 
                        'size'   => 94500
                    ], 
                    [
                        'ttl'    => '3段以上', 
                        'len_01' => 45, 
                        'len_02' => 90, 
                        'len_03' => 35, 
                        'size'   => 141750
                    ], 
                ]
            ],
            // パイプハンガー
            [
                'ttl' => 'パイプハンガー',
                'img' => 'seikatuyouhin/paipuhanger.png', 
                'items' => [
                    [
                        'ttl'    => '小', 
                        'len_01' => 90, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 243000
                    ], 
                    [
                        'ttl'    => '大', 
                        'len_01' => 120, 
                        'len_02' => 90, 
                        'len_03' => 30, 
                        'size'   => 324000
                    ], 
                ]
            ],
            // 布団一式
            [
                'ttl' => '布団一式',
                'img' => 'seikatuyouhin/huton.png', 
                'len_01' => 60, 
                'len_02' => 90, 
                'len_03' => 50, 
                'size'   => 270000, 
                'items' => []
            ], 
            // 物干し竿
            [
                'ttl' => '物干し竿',
                'img' => 'seikatuyouhin/monohosizao.png', 
                'len_01' => 20, 
                'len_02' => 20, 
                'len_03' => 150, 
                'size'   => 60000, 
                'items' => []
            ], 
            // スーツケース
            [
                'ttl' => 'スーツケース',
                'img' => 'seikatuyouhin/su-tucase.jpg', 
                'len_01' => 60, 
                'len_02' => 60, 
                'len_03' => 30, 
                'size'   => 108000, 
                'items' => []
            ], 
        ]
    ], 
    [
        'ttl'   => 'その他',
        'items' => [
            // 自転車
            [
                'ttl' => '自転車',
                'img' => '', 
                'items' => [
                    [
                        'ttl'    => '大人用', 
                        'len_01' => 160, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 880000
                    ], 
                    [
                        'ttl'    => '子供用', 
                        'len_01' => 100, 
                        'len_02' => 50, 
                        'len_03' => 90, 
                        'size'   => 450000
                    ], 
                    [
                        'ttl'    => '折り畳み', 
                        'len_01' => 80, 
                        'len_02' => 50, 
                        'len_03' => 110, 
                        'size'   => 440000
                    ], 
                ]
            ],
        ]
    ], 
    [
        'ttl'   => 'ダンボール',
        'items' => [
            // ダンボール
            [
                'ttl' => 'ダンボール',
                'img' => '', 
                'items' => [
                    [
                        'ttl'    => '大', 
                        'len_01' => 55, 
                        'len_02' => 40, 
                        'len_03' => 35, 
                        'size'   => 77000
                    ], 
                    [
                        'ttl'    => '小', 
                        'len_01' => 45, 
                        'len_02' => 30, 
                        'len_03' => 40, 
                        'size'   => 63000
                    ], 
                ]
            ],
        ]
    ], 
];
?>